{"body": "PRESIDENT OF THE UNITED STATES-GEORGE WASHINGTON, of Virginia.\nVICE PRESIDENT OF THE UNITED STATES-JOHN ADAMS, of Massachusetts.\nSECRETARY OF STATE-JOHN JAY, of New York, was Secretary for Foreign Affairs under the Confederation, and continued to\nact, at the request of Washington, until Thomas Jefferson took office. THOMAS JEFFERSON, of Virginia, September 26, 1789;\nentered upon duties March 22, 1790.\n\nSECRETARY OF THE TREASURY-ALEXANDER HAMILTON, of New York, September 11, 1789.\nSECRETARY OF WAR-HENRY KNOX, of Massachusetts, September 12, 1789.\nATTORNEY GENERAL-EDMUND RANDOLPH, of Virginia, September 26, 1789; entered upon duties February 2, 1790.\nPOSTMASTER GENERAL-SAMUEL OSGOOD, of Massachusetts, September 26, 1789. TIMOTHY PICKERING, of Pennsylvania, August\n\n12, 1791; entered upon duties August 19, 1791.", "president": "GEORGE WASHINGTON", "dates": "APRIL 30, 1789, TO MARCH 3, 1793", "type": "presidential_administration", "description": "First Administration of GEORGE WASHINGTON"}
{"body": "PRESIDENT OF THE UNITED STATES-GEORGE WASHINGTON, of Virginia.\nVICE PRESIDENT OF THE UNITED STATES-JOHN ADAMS, of Massachusetts.\nSECRETARY OF STATE-THOMAS JEFFERSON, of Virginia, continued from preceding administration. EDMUND RANDOLPH, of Virginia, January 2, 1794. TIMOTHY PICKERING, of Pennsylvania (Secretary of War), ad interim, August 20, 1795. TIMOTHY PICKERING, of Pennsylvania, December 10, 1795.\n\nSECRETARY OF THE TREASURY-ALEXANDER HAMILTON, of New York, continued from preceding administration. OLIVER WOLCOTT, JR., of Connecticut, February 2, 1795.\n\nSECRETARY OF WAR-HENRY KNOX, of Massachusetts, continued from preceding administration. TIMOTHY PICKERING, of Pennsylvania, January 2, 1795. TIMOTHY PICKERING, of Pennsylvania (Secretary of State), ad interim, December 10, 1795, to February\n5, 1796. JAMES MCHENRY, of Maryland, January 27, 1796; entered upon duties February 6, 1796.\n\nATTORNEY GENERAL-EDMUND RANDOLPH, of Virginia, continued from preceding administration. WILLIAM BRADFORD, of Pennsylvania, January 27, 1794; entered upon duties January 29, 1794. CHARLES LEE, of Virginia, December 10, 1795.\n\nPOSTMASTER GENERAL-TIMOTHY PICKERING, of Pennsylvania, continued from preceding administration. TIMOTHY PICKERING, of\n\nPennsylvania, recommissioned June 1, 1794. JOSEPH HABERSHAM, of Georgia, February 25, 1795.", "president": "GEORGE WASHINGTON", "dates": "MARCH 4, 1793, TO MARCH 3, 1797", "type": "presidential_administration", "description": "Second Administration of GEORGE WASHINGTON"}
{"body": "PRESIDENT OF THE UNITED STATES-JOHN ADAMS, of Massachusetts.\nVICE PRESIDENT OF THE UNITED STATES-THOMAS JEFFERSON, of Virginia.\nSECRETARY OF STATE-TIMOTHY PICKERING, of Pennsylvania, continued from preceding administration; resignation requested May\n10, 1800, but declining to resign, he was dismissed May 12, 1800. CHARLES LEE, of Virginia, (Attorney General), ad interim,\nMay 13, 1800. JOHN MARSHALL, of Virginia, May 13, 1800; entered upon duties June 6, 1800. JOHN MARSHALL, of Virginia\n(Chief Justice of the United States), ad interim, February 4, 1801, to March 3, 1801.\n\nSECRETARY OF THE TREASURY-OLIVER WOLCOTT, JR., of Connecticut, continued from preceding administration. SAMUEL DEXTER, of Massachusetts, January 1, 1801.\n\nSECRETARY OF WAR-JAMES MCHENRY, of Maryland, continued from preceding administration. BENJAMIN STODDERT, of Maryland\n(Secretary of the Navy), ad interim, June 1, 1800, to June 12, 1800. SAMUEL DEXTER, of Massachusetts, May 13, 1800; entered\nupon duties June 12, 1800. SAMUEL DEXTER, of Massachusetts (Secretary of the Treasury), ad interim, January 1, 1801.\n\nATTORNEY GENERAL-CHARLES LEE, of Virginia, continued from preceding administration.\nPOSTMASTER GENERAL-JOSEPH HABERSHAM, of Georgia, continued from preceding administration.\nSECRETARY OF THE NAVY-BENJAMIN STODDERT, of Maryland, May 21, 1798; entered upon duties June 18, 1798.\n\n[ 3 ]", "president": "JOHN ADAMS", "dates": "MARCH 4, 1797, TO MARCH 3, 1801", "type": "presidential_administration", "description": "Administration of JOHN ADAMS"}
{"body": "PRESIDENT OF THE UNITED STATES-THOMAS JEFFERSON, of Virginia.\nVICE PRESIDENT OF THE UNITED STATES-AARON BURR, of New York.\nSECRETARY OF STATE-JOHN MARSHALL, of Virginia (Chief Justice of the United States), for one day (March 4, 1801), and for\na special purpose. LEVI LINCOLN, of Massachusetts (Attorney General), ad interim, March 5, 1801. JAMES MADISON, of Virginia,\nMarch 5, 1801; entered upon duties May 2, 1801.\n\nSECRETARY OF THE TREASURY-SAMUEL DEXTER, of Massachusetts, continued from preceding administration to May 6, 1801.\n\nALBERT GALLATIN, of Pennsylvania, May 14, 1801.\n\nSECRETARY OF WAR-HENRY DEARBORN, of Massachusetts, March 5, 1801.\nATTORNEY GENERAL-LEVI LINCOLN, of Massachusetts, March 5, 1801, to December 31, 1804.\nPOSTMASTER GENERAL-JOSEPH HABERSHAM, of Georgia, continued from preceding administration. GIDEON GRANGER, of Connecticut, November 28, 1801.\n\nSECRETARY OF THE NAVY-BENJAMIN STODDERT, of Maryland, continued from preceding administration. HENRY DEARBORN, of\nMassachusetts (Secretary of War), ad interim, April 1, 1801. ROBERT SMITH, of Maryland, July 15, 1801; entered upon duties\nJuly 27, 1801.", "president": "THOMAS JEFFERSON", "dates": "MARCH 4, 1801, TO MARCH 3, 1805", "type": "presidential_administration", "description": "First Administration of THOMAS JEFFERSON"}
{"body": "PRESIDENT OF THE UNITED STATES-THOMAS JEFFERSON, of Virginia.\nVICE PRESIDENT OF THE UNITED STATES-GEORGE CLINTON, of New York.\nSECRETARY OF STATE-JAMES MADISON, of Virginia, continued from preceding administration.\nSECRETARY OF THE TREASURY-ALBERT GALLATIN, of Pennsylvania, continued from preceding administration.\nSECRETARY OF WAR-HENRY DEARBORN, of Massachusetts, continued from preceding administration. JOHN SMITH (chief clerk),\n\nad interim, February 17, 1809.\n\nATTORNEY GENERAL-JOHN BRECKENRIDGE, of Kentucky, August 7, 1805. (Died December 14, 1806.) CAESAR A. RODNEY, of Delaware, January 20, 1807.\n\nPOSTMASTER GENERAL-GIDEON GRANGER, of Connecticut, continued from preceding administration.\nSECRETARY OF THE NAVY-ROBERT SMITH, of Maryland, continued from preceding administration.", "president": "THOMAS JEFFERSON", "dates": "MARCH 4, 1805, TO MARCH 3, 1809", "type": "presidential_administration", "description": "Second Administration of THOMAS JEFFERSON"}
{"body": "PRESIDENT OF THE UNITED STATES-JAMES MADISON, of Virginia.\nVICE PRESIDENT OF THE UNITED STATES-GEORGE CLINTON, of New York. (Died April 20, 1812.)\nPRESIDENT PRO TEMPORE OF THE SENATE-WILLIAM H. CRAWFORD, of Georgia.\nSECRETARY OF STATE-ROBERT SMITH, of Maryland, March 6, 1809. JAMES MONROE, of Virginia, April 2, 1811; entered upon\n\nduties April 6, 1811.\n\nSECRETARY OF THE TREASURY-ALBERT GALLATIN, of Pennsylvania, continued from preceding administration.\nSECRETARY OF WAR-JOHN SMITH (chief clerk), ad interim, continued from preceding administration. WILLIAM EUSTIS, of Massachusetts, March 7, 1809; entered upon duties April 8, 1809; served to December 31, 1812. JAMES MONROE, of Virginia (Secretary of State), ad interim, January 1, 1813. JOHN ARMSTRONG, of New York, January 13, 1813; entered upon duties February\n5, 1813.\n\nATTORNEY GENERAL-CAESAR A. RODNEY, of Delaware, continued from preceding administration. (Resigned December 5, 1811.)\n\nWILLIAM PINKNEY, of Maryland, December 11, 1811; entered upon duties January 6, 1812.\n\nPOSTMASTER GENERAL-GIDEON GRANGER, of Connecticut, continued from preceding administration.\nSECRETARY OF THE NAVY-ROBERT SMITH, of Maryland, continued from preceding administration. CHARLES W. GOLDSBOROUGH\n(chief clerk), ad interim, March 8, 1809. PAUL HAMILTON, of South Carolina, March 7, 1809; entered upon duties May 15, 1809;\nserved to December 31, 1812. CHARLES W. GOLDSBOROUGH (chief clerk), ad interim, January 7, 1813, to January 18, 1813.\nWILLIAM JONES, of Pennsylvania, January 12, 1813; entered upon duties January 19, 1813.", "president": "JAMES MADISON", "dates": "MARCH 4, 1809, TO MARCH 3, 1813", "type": "presidential_administration", "description": "First Administration of JAMES MADISON"}
{"body": "PRESIDENT OF THE UNITED STATES-JAMES MADISON, of Virginia.\nVICE PRESIDENT OF THE UNITED STATES-ELBRIDGE GERRY, of Massachusetts. (Died November 23, 1814.)\nPRESIDENT PRO TEMPORE OF THE SENATE-JOHN GAILLARD, of South Carolina.\nSECRETARY OF STATE-JAMES MONROE, of Virginia, continued from preceding administration. JAMES MONROE, of Virginia (Secretary of War), ad interim, October 1, 1814. JAMES MONROE, of Virginia, February 28, 1815.\n\nSECRETARY OF THE TREASURY-ALBERT GALLATIN, of Pennsylvania, continued from preceding administration. WILLIAM JONES,\nof Pennsylvania (Secretary of the Navy), performed the duties of the Secretary of the Treasury during the absence of Mr. Gallatin in Europe (April 21, 1813, to February 9, 1814). GEORGE W. CAMPBELL, of Tennessee, February 9, 1814. ALEXANDER J.\nDALLAS, of Pennsylvania, October 6, 1814; entered upon duties October 14, 1814. WILLIAM H. CRAWFORD, of Georgia, October\n22, 1816.\n\nSECRETARY OF WAR-JOHN ARMSTRONG, of New York, continued from preceding administration. JAMES MONROE, of Virginia (Secretary of State), ad interim, August 30, 1814. JAMES MONROE, of Virginia, September 27, 1814; entered upon duties October\n1, 1814. JAMES MONROE, of Virginia (Secretary of State), ad interim, March 1, 1815. ALEXANDER J. DALLAS, of Pennsylvania\n(Secretary of the Treasury), ad interim, March 14, 1815, to August 8, 1815. WILLIAM H. CRAWFORD, of Georgia, August 1, 1815;\nentered upon duties August 8, 1815. GEORGE GRAHAM (chief clerk), ad interim, October 22, 1816, to close of administration.\nATTORNEY GENERAL-WILLIAM PINKNEY, of Maryland, continued from preceding administration. RICHARD RUSH, of Pennsylvania,\n\nFebruary 10, 1814; entered upon duties the day following.\n\nPOSTMASTER GENERAL-GIDEON GRANGER, of Connecticut, continued from preceding administration. RETURN J. MEIGS, JR., of\n\nOhio, March 17, 1814; entered upon duties April 11, 1814.\n\nSECRETARY OF THE NAVY-WILLIAM JONES, of Pennsylvania, continued from preceding administration. BENJAMIN HOMANS (chief\nclerk), ad interim, December 2, 1814. BENJAMIN W. CROWNINSHIELD, of Massachusetts, December 19, 1814; entered upon duties\nJanuary 16, 1815.", "president": "JAMES MADISON", "dates": "MARCH 4, 1813, TO MARCH 3, 1817", "type": "presidential_administration", "description": "Second Administration of JAMES MADISON"}
{"body": "PRESIDENT OF THE UNITED STATES-JAMES MONROE, of Virginia.\nVICE PRESIDENT OF THE UNITED STATES-DANIEL D. TOMPKINS, of New York.\nSECRETARY OF STATE-JOHN GRAHAM (chief clerk), ad interim, March 4, 1817. RICHARD RUSH, of Pennsylvania (Attorney General), ad interim, March 10, 1817. JOHN QUINCY ADAMS, of Massachusetts, March 5, 1817; entered upon duties September 22,\n1817.\nSECRETARY OF THE TREASURY-WILLIAM H. CRAWFORD, of Georgia, continued from preceding administration. WILLIAM H.\nCRAWFORD, of Georgia, recommissioned March 5, 1817.\n\nSECRETARY OF WAR-GEORGE GRAHAM (chief clerk), ad interim, March 4, 1817. JOHN C. CALHOUN, of South Carolina, October\n\n8, 1817; entered upon duties December 10, 1817.\n\nATTORNEY GENERAL-RICHARD RUSH, of Pennsylvania, continued from preceding administration to October 30, 1817. WILLIAM\nWIRT, of Virginia, November 13, 1817; entered upon duties November 15, 1817.\n\nPOSTMASTER GENERAL-RETURN J. MEIGS, JR., of Ohio, continued from preceding administration.\nSECRETARY OF THE NAVY-BENJAMIN W. CROWNINSHIELD, of Massachusetts, continued from preceding administration. JOHN C.\nCALHOUN, of South Carolina (Secretary of War), ad interim, October 1, 1818. SMITH THOMPSON, of New York, November 9,\n1818; entered upon duties January 1, 1819.", "president": "JAMES MONROE", "dates": "MARCH 4, 1817, TO MARCH 3, 1821", "type": "presidential_administration", "description": "First Administration of JAMES MONROE"}
{"body": "PRESIDENT OF THE UNITED STATES-JAMES MONROE, of Virginia.\nVICE PRESIDENT OF THE UNITED STATES-DANIEL D. TOMPKINS, of New York.\nSECRETARY OF STATE-JOHN QUINCY ADAMS, of Massachusetts, continued from preceding administration.\nSECRETARY OF THE TREASURY-WILLIAM H. CRAWFORD, of Georgia, continued from preceding administration.\nSECRETARY OF WAR-JOHN C. CALHOUN, of South Carolina, continued from preceding administration.\nATTORNEY GENERAL-WILLIAM WIRT, of Virginia, continued from preceding administration.\nPOSTMASTER GENERAL-RETURN J. MEIGS, JR., of Ohio, continued from preceding administration. JOHN MCLEAN, of Ohio, commissioned June 26, 1823, to take effect July 1, 1823.\n\nSECRETARY OF THE NAVY-SMITH THOMPSON, of New York, continued from preceding administration. JOHN RODGERS (commodore, United States Navy, and President of the Board of Navy Commissioners), ad interim, September 1, 1823. SAMUEL L.\nSOUTHARD, of New Jersey, September 16, 1823.", "president": "JAMES MONROE", "dates": "MARCH 4, 1821, TO MARCH 3, 1825", "type": "presidential_administration", "description": "Second Administration of JAMES MONROE"}
{"body": "PRESIDENT OF THE UNITED STATES-MARTIN VAN BUREN, of New York.\nVICE PRESIDENT OF THE UNITED STATES-RICHARD M. JOHNSON, of Kentucky.\nSECRETARY OF STATE-JOHN FORSYTH, of Georgia, continued from preceding administration.\nSECRETARY OF THE TREASURY-LEVI WOODBURY, of New Hampshire, continued from preceding administration.\nSECRETARY OF WAR-BENJAMIN F. BUTLER, of New York, ad interim, continued from preceding administration. JOEL R.\nPOINSETT, of South Carolina, March 7, 1837; entered upon duties March 14, 1837.\n\nATTORNEY GENERAL-BENJAMIN F. BUTLER, of New York, continued from preceding administration. FELIX GRUNDY, of Tennessee,\n\nJuly 5, 1838, to take effect September 1, 1838. HENRY D. GILPIN, of Pennsylvania, January 11, 1840.\n\nPOSTMASTER GENERAL-AMOS KENDALL, of Kentucky, continued from preceding administration. JOHN M. NILES, of Connecticut,\n\nMay 19, 1840, to take effect May 25, 1840; entered upon duties May 26, 1840.\n\nSECRETARY OF THE NAVY-MAHLON DICKERSON, of New Jersey, continued from preceding administration. JAMES K. PAULDING,\nof New York, June 25, 1838, to take effect ‘‘after the 30th instant’’; entered upon duties July 1, 1838.", "president": "MARTIN VAN BUREN", "dates": "MARCH 4, 1837, TO MARCH 3, 1841", "type": "presidential_administration", "description": "Administration of MARTIN VAN BUREN"}
{"body": "PRESIDENT OF THE UNITED STATES-WILLIAM HENRY HARRISON, of Ohio. (Died April 4, 1841.)\nVICE PRESIDENT OF THE UNITED STATES-JOHN TYLER, of Virginia.\nSECRETARY OF STATE-J. L. MARTIN (chief clerk), ad interim, March 4, 1841. DANIEL WEBSTER, of Massachusetts, March 5,\n\n1841.\nSECRETARY OF THE TREASURY-MCCLINTOCK YOUNG (chief clerk), ad interim, March 4, 1841. THOMAS EWING, of Ohio, March\n\n5, 1841.\n\nSECRETARY OF WAR-JOHN BELL, of Tennessee, March 5, 1841.\nATTORNEY GENERAL-JOHN J. CRITTENDEN, of Kentucky, March 5, 1841.\nPOSTMASTER GENERAL-SELAH R. HOBBIE, of New York (First Assistant Postmaster General), ad interim, March 4, 1841.\n\nFRANCIS GRANGER, of New York, March 6, 1841; entered upon duties March 8, 1841.\n\nSECRETARY OF THE NAVY-JOHN D. SIMMS (chief clerk), ad interim, March 4, 1841. GEORGE E. BADGER, of North Carolina,\n\nMarch 5, 1841.", "president": "WILLIAM HENRY HARRISON", "dates": "MARCH 4, 1841, TO APRIL 4, 1841", "type": "presidential_administration", "description": "Administration of WILLIAM HENRY HARRISON"}
{"body": "PRESIDENT OF THE UNITED STATES-JOHN TYLER, of Virginia.\nPRESIDENT PRO TEMPORE OF THE SENATE-SAMUEL L. SOUTHARD, of New Jersey; WILLIE P. MANGUM, of North Carolina.\nSECRETARY OF STATE-DANIEL WEBSTER, of Massachusetts, continued from preceding administration. HUGH S. LEGARE´ , of South\nCarolina (Attorney General), ad interim, May 9, 1843. WILLIAM S. DERRICK (chief clerk), ad interim, June 21, 1843. ABEL P.\nUPSHUR, of Virginia (Secretary of the Navy), ad interim, June 24, 1843. ABEL P. UPSHUR, of Virginia, July 24, 1843. (Killed\nby a gun explosion on the U.S.S. Princeton February 28, 1844.) JOHN NELSON, of Maryland (Attorney General), ad interim,\nFebruary 29, 1844. JOHN C. CALHOUN, of South Carolina, March 6, 1844; entered upon duties April 1, 1844.\n\nSECRETARY OF THE TREASURY-THOMAS EWING, of Ohio, continued from preceding administration. MCCLINTOCK YOUNG (chief\nclerk), ad interim, September 13, 1841. WALTER FORWARD, of Pennsylvania, September 13, 1841. MCCLINTOCK YOUNG (chief\nclerk), ad interim, March 1, 1843. JOHN C. SPENCER, of New York, March 3, 1843; entered upon duties March 8, 1843.\nMCCLINTOCK YOUNG (chief clerk), ad interim, May 2, 1844. GEORGE M. BIBB, of Kentucky, June 15, 1844; entered upon duties\nJuly 4, 1844.\n\nSECRETARY OF WAR-JOHN BELL, of Tennessee, continued from preceding administration. ALBERT M. LEA, of Maryland (chief\nclerk), ad interim, September 12, 1841. JOHN C. SPENCER, of New York, October 12, 1841. JAMES M. PORTER, of Pennsylvania,\nMarch 8, 1843. WILLIAM WILKINS, of Pennsylvania, February 15, 1844; entered upon duties February 20, 1844.\n\nATTORNEY GENERAL-JOHN J. CRITTENDEN, of Kentucky, continued from preceding administration. HUGH S. LEGARE´ , of South\nCarolina, September 13, 1841; entered upon duties September 20, 1841. (Died June 20, 1843.) JOHN NELSON, of Maryland, July\n1, 1843.\n\nPOSTMASTER GENERAL-FRANCIS GRANGER, of New York, continued from preceding administration. SELAH R. HOBBIE, of New\nYork (First Assistant Postmaster General), ad interim, September 14, 1841. CHARLES A. WICKLIFFE, of Kentucky, September\n13, 1841; entered upon duties October 13, 1841.\n\nSECRETARY OF THE NAVY-GEORGE E. BADGER, of North Carolina, continued from preceding administration. JOHN D. SIMMS\n(chief clerk), ad interim, September 11, 1841. ABEL P. UPSHUR, of Virginia, September 13, 1841; entered upon duties October\n11, 1841. DAVID HENSHAW, of Massachusetts, July 24, 1843. THOMAS W. GILMER, of Virginia, February 15, 1844; entered upon\nduties February 19, 1844. (Killed by a gun explosion on the U.S.S. Princeton February 28, 1844.) LEWIS WARRINGTON (Captain,\nU.S. Navy), ad interim, February 29, 1844. JOHN Y. MASON, of Virginia, March 14, 1844; entered upon duties March 26, 1844.", "president": "JOHN TYLER", "dates": "APRIL 4, 1841, TO MARCH 3, 1845", "type": "presidential_administration", "description": "Administration of JOHN TYLER"}
{"body": "PRESIDENT OF THE UNITED STATES-JOHN QUINCY ADAMS, of Massachusetts.\nVICE PRESIDENT OF THE UNITED STATES-JOHN C. CALHOUN, of South Carolina.\nSECRETARY OF STATE-DANIEL BRENT (chief clerk), ad interim, March 4, 1825. HENRY CLAY, of Kentucky, March 7, 1825.\nSECRETARY OF THE TREASURY-SAMUEL L. SOUTHARD, of New Jersey (Secretary of the Navy), ad interim, March 7, 1825.\n\nRICHARD RUSH, of Pennsylvania, March 7, 1825; entered upon duties August 1, 1825.\n\nSECRETARY OF WAR-JAMES BARBOUR, of Virginia, March 7, 1825. SAMUEL L. SOUTHARD, of New Jersey (Secretary of the Navy),\n\nad interim, May 26, 1828. PETER B. PORTER, of New York, May 26, 1828; entered upon duties June 21, 1828.\n\nATTORNEY GENERAL-WILLIAM WIRT, of Virginia, continued from preceding administration.\nPOSTMASTER GENERAL-JOHN MCLEAN, of Ohio, continued from preceding administration.\nSECRETARY OF THE NAVY-SAMUEL L. SOUTHARD, of New Jersey, continued from preceding administration.", "president": "JOHN QUINCY ADAMS", "dates": "MARCH 4, 1825, TO MARCH 3, 1829", "type": "presidential_administration", "description": "Administration of JOHN QUINCY ADAMS"}
{"body": "PRESIDENT OF THE UNITED STATES-ANDREW JACKSON, of Tennessee.\nVICE PRESIDENT OF THE UNITED STATES-JOHN C. CALHOUN, of South Carolina. (Resigned December 28, 1832.)\nPRESIDENT PRO TEMPORE OF THE SENATE-HUGH LAWSON WHITE, of Tennessee.\nSECRETARY OF STATE-JAMES A. HAMILTON, of New York, ad interim, March 4, 1829. MARTIN VAN BUREN, of New York, March\n\n6, 1829; entered upon duties March 28, 1829. EDWARD LIVINGSTON, of Louisiana, May 24, 1831.\n\nSECRETARY OF THE TREASURY-SAMUEL D. INGHAM, of Pennsylvania, March 6, 1829. ASBURY DICKINS (chief clerk), ad interim,\n\nJune 21, 1831. LOUIS MCLANE, of Delaware, August 8, 1831.\n\nSECRETARY OF WAR-JOHN H. EATON, of Tennessee, March 9, 1829. PHILIP G. RANDOLPH (chief clerk), ad interim, June 20,\n1831. ROGER B. TANEY, of Maryland (Attorney General), ad interim, July 21, 1831. LEWIS CASS, of Ohio, August 1, 1831; entered upon duties August 8, 1831.\n\nATTORNEY GENERAL-JOHN M. BERRIEN, of Georgia, March 9, 1829, June 22, 1831. ROGER B. TANEY, of Maryland, July 20,\n\n1831.\nPOSTMASTER GENERAL-JOHN MCLEAN, of Ohio, continued from preceding administration. WILLIAM T. BARRY, of Kentucky,\n\nMarch 9, 1829; entered upon duties April 6, 1829.\n\nSECRETARY OF THE NAVY-CHARLES HAY (chief clerk), ad interim, March 4, 1829. JOHN BRANCH, of North Carolina, March\n\n9, 1829. JOHN BOYLE (chief clerk), ad interim, May 12, 1831. LEVI WOODBURY, of New Hampshire, May 23, 1831.", "president": "ANDREW JACKSON", "dates": "MARCH 4, 1829, TO MARCH 3, 1833", "type": "presidential_administration", "description": "First Administration of ANDREW JACKSON"}
{"body": "PRESIDENT OF THE UNITED STATES-ANDREW JACKSON, of Tennessee.\nVICE PRESIDENT OF THE UNITED STATES-MARTIN VAN BUREN, of New York.\nSECRETARY OF STATE-EDWARD LIVINGSTON, of Louisiana, continued from preceding administration. LOUIS MCLANE, of Delaware,\n\nMay 29, 1833. JOHN FORSYTH, of Georgia, June 27, 1834; entered upon duties July 1, 1834.\n\nSECRETARY OF THE TREASURY-LOUIS MCLANE, of Delaware, continued from preceding administration. WILLIAM J. DUANE, of\nPennsylvania, May 29, 1833; entered upon duties June 1, 1833. ROGER B. TANEY, of Maryland, September 23, 1833. MCCLINTOCK YOUNG (chief clerk), ad interim, June 25, 1834. LEVI WOODBURY, of New Hampshire, June 27, 1834; entered upon duties\nJuly 1, 1834.\n\nSECRETARY OF WAR-LEWIS CASS, of Ohio, continued from preceding administration. CAREY A. HARRIS, of Tennessee (Commissioner of Indian Affairs), ad interim, October 5, 1836. BENJAMIN F. BUTLER, of New York (Attorney General), ad interim, October 26, 1836. BENJAMIN F. BUTLER, of New York, commissioned March 3, 1837, ad interim, ‘‘during the pleasure of the President, until a successor, duly appointed, shall accept such office and enter upon the duties thereof.’’\n\nATTORNEY GENERAL-ROGER B. TANEY, of Maryland, continued from preceding administration to September 23, 1833. BENJAMIN\nF. BUTLER, of New York, November 15, 1833; entered upon duties November 18, 1833.\n\nPOSTMASTER GENERAL-WILLIAM T. BARRY, of Kentucky, continued from preceding administration. AMOS KENDALL, of Kentucky,\n\nMay 1, 1835.\n\nSECRETARY OF THE NAVY-LEVI WOODBURY, of New Hampshire, continued from preceding administration. MAHLON DICKERSON,\nof New Jersey, June 30, 1834.", "president": "ANDREW JACKSON", "dates": "MARCH 4, 1833, TO MARCH 3, 1837", "type": "presidential_administration", "description": "Second Administration of ANDREW JACKSON"}
{"body": "PRESIDENT OF THE UNITED STATES-JAMES K. POLK, of Tennessee.\nVICE PRESIDENT OF THE UNITED STATES-GEORGE M. DALLAS, of Pennsylvania.\nSECRETARY OF STATE-JOHN C. CALHOUN, of South Carolina, continued from preceding administration. JAMES BUCHANAN, of\n\nPennsylvania, March 6, 1845; entered upon duties March 10, 1845.\n\nSECRETARY OF THE TREASURY-GEORGE M. BIBB, of Kentucky, continued from preceding administration. ROBERT J. WALKER,\nof Mississippi, March 6, 1845; entered upon duties March 8, 1845.\n\nSECRETARY OF WAR-WILLIAM WILKINS, of Pennsylvania, continued from preceding administration. WILLIAM L. MARCY, of New\n\nYork, March 6, 1845; entered upon duties March 8, 1845.\n\nATTORNEY GENERAL-JOHN NELSON, of Maryland, continued from preceding administration. JOHN Y. MASON, of Virginia, March\n6, 1845; entered upon duties March 11, 1845. NATHAN CLIFFORD, of Maine, October 17, 1846, to March 18, 1848, when he\nresigned. ISAAC TOUCEY, of Connecticut, June 21, 1848; entered upon duties June 29, 1848.\n\nPOSTMASTER GENERAL-CHARLES A. WICKLIFFE, of Kentucky, continued from preceding administration. CAVE JOHNSON, of Tennessee, March 6, 1845.\n\nSECRETARY OF THE NAVY-JOHN Y. MASON, of Virginia, continued from preceding administration. GEORGE BANCROFT, of Massachusetts, March 10, 1845. JOHN Y. MASON, of Virginia, September 9, 1846.", "president": "JAMES K. POLK", "dates": "MARCH 4, 1845, TO MARCH 3, 1849", "type": "presidential_administration", "description": "Administration of JAMES K. POLK"}
{"body": "PRESIDENT OF THE UNITED STATES-ZACHARY TAYLOR, of Louisiana. (Died July 9, 1850.)\nVICE PRESIDENT OF THE UNITED STATES-MILLARD FILLMORE, of New York.\nSECRETARY OF STATE-JAMES BUCHANAN, of Pennsylvania, continued from preceding administration. JOHN M. CLAYTON, of Delaware, March 7, 1849.\n\nSECRETARY OF THE TREASURY-ROBERT J. WALKER, of Mississippi, continued from preceding administration. MCCLINTOCK\nYOUNG (chief clerk), ad interim, March 6, 1849. WILLIAM M. MEREDITH, of Pennsylvania, March 8, 1849.\n\nSECRETARY OF WAR-WILLIAM L. MARCY, of New York, continued from preceding administration. REVERDY JOHNSON, of Maryland\n(Attorney General), ad interim, March 8, 1849. GEORGE W. CRAWFORD, of Georgia, March 8, 1849; entered upon duties March\n14, 1849.\n\nATTORNEY GENERAL-ISAAC TOUCEY, of Connecticut, continued from preceding administration. REVERDY JOHNSON, of Maryland,\n\nMarch 8, 1849.\n\nPOSTMASTER GENERAL-CAVE JOHNSON, of Tennessee, continued from preceding administration. SELAH R. HOBBIE, of New York\n\n(First Assistant Postmaster General), ad interim, March 6, 1849. JACOB COLLAMER, of Vermont, March 8, 1849.\n\nSECRETARY OF THE NAVY-JOHN Y. MASON, of Virginia, continued from preceding administration. WILLIAM B. PRESTON, of Virginia, March 8, 1849.\n\nSECRETARY OF THE INTERIOR-THOMAS EWING, of Ohio, March 8, 1849.", "president": "ZACHARY TAYLOR", "dates": "MARCH 4, 1849, TO JULY 9, 1850", "type": "presidential_administration", "description": "Administration of ZACHARY TAYLOR"}
{"body": "PRESIDENT OF THE UNITED STATES-MILLARD FILLMORE, of New York.\nPRESIDENT PRO TEMPORE OF THE SENATE-WILLIAM R. KING, of Alabama; DAVID R. ATCHISON, of Missouri.\nSECRETARY OF STATE-JOHN M. CLAYTON, of Delaware, continued from preceding administration. DANIEL WEBSTER, of Massachusetts, July 22, 1850. (Died October 24, 1852.) CHARLES M. CONRAD, of Louisiana (Secretary of War), ad interim, October 25,\n1852. EDWARD EVERETT, of Massachusetts, November 6, 1852.\n\nSECRETARY OF THE TREASURY-WILLIAM M. MEREDITH, of Pennsylvania, continued from preceding administration. THOMAS\nCORWIN, of Ohio July 23, 1850.\n\nSECRETARY OF WAR-GEORGE W. CRAWFORD, of Georgia, continued from preceding administration. SAMUEL J. ANDERSON (chief\nclerk), ad interim, July 23, 1850. WINFIELD SCOTT (Major General, U.S. Army), ad interim, July 24, 1850. CHARLES M. CONRAD,\nof Louisiana, August 15, 1850.\n\nATTORNEY GENERAL-REVERDY JOHNSON, of Maryland, continued from preceding administration, served to July 22, 1850. JOHN\nJ. CRITTENDEN, of Kentucky, July 22, 1850; entered upon duties August 14, 1850.\n\nPOSTMASTER GENERAL-JACOB COLLAMER, of Vermont, continued from preceding administration. NATHAN K. HALL, of New York,\n\nJuly 23, 1850. SAMUEL D. HUBBARD, of Connecticut, August 31, 1852; entered upon duties September 14, 1852.\n\nSECRETARY OF THE NAVY-WILLIAM B. PRESTON, of Virginia, continued from preceding administration. LEWIS WARRINGTON (Captain, U.S. Navy), ad interim, July 23, 1850. WILLIAM A. GRAHAM, of North Carolina, July 22, 1850; entered upon duties August\n2, 1850. JOHN P. KENNEDY, of Maryland, July 22, 1852; entered upon duties July 26, 1852.\n\nSECRETARY OF THE INTERIOR-THOMAS EWING, of Ohio, continued from preceding administration. DANIEL C. GODDARD (chief\nclerk), ad interim, July 23, 1850. THOMAS M. T. MCKENNAN, of Pennsylvania, August 15, 1850. DANIEL C. GODDARD (chief\nclerk), ad interim, August 27, 1850. ALEXANDER H. H. STUART, of Virginia, September 12, 1850; entered upon duties September\n16, 1850.", "president": "MILLARD FILLMORE", "dates": "JULY 10, 1850, TO MARCH 3, 1853", "type": "presidential_administration", "description": "Administration of MILLARD FILLMORE"}
{"body": "PRESIDENT OF THE UNITED STATES-FRANKLIN PIERCE, of New Hampshire.\nVICE PRESIDENT OF THE UNITED STATES-WILLIAM R. KING, of Alabama. (Died April 18, 1853.)\nPRESIDENT PRO TEMPORE OF THE SENATE-DAVID R. ATCHISON, of Missouri; LEWIS CASS, of Michigan; JESSE D. BRIGHT,\nof Indiana; CHARLES E. STUART, of Michigan; JAMES M. MASON, of Virginia.\n\nSECRETARY OF STATE-WILLIAM HUNTER (chief clerk), ad interim, March 4, 1853. WILLIAM L. MARCY, of New York, March 7,\n\n1853.\nSECRETARY OF THE TREASURY-THOMAS CORWIN, of Ohio, continued from preceding administration. JAMES GUTHRIE, of Kentucky, March 7, 1853.\n\nSECRETARY OF WAR-CHARLES M. CONRAD, of Louisiana, continued from preceding administration. JEFFERSON DAVIS, of Mississippi, March 7, 1853. SAMUEL COOPER (Adjutant General, U.S. Army), ad interim, March 3, 1857.\n\nATTORNEY GENERAL-JOHN J. CRITTENDEN, of Kentucky, continued from preceding administration. CALEB CUSHING, of Massachusetts, March 7, 1853.\n\nPOSTMASTER GENERAL-SAMUEL D. HUBBARD, of Connecticut, continued from preceding administration. JAMES CAMPBELL, of\n\nPennsylvania, March 7, 1853.\n\nSECRETARY OF THE NAVY-JOHN P. KENNEDY, of Maryland, continued from preceding administration. JAMES C. DOBBIN, of\n\nNorth Carolina, March 7, 1853.\n\nSECRETARY OF THE INTERIOR-ALEXANDER H. H. STUART, of Virginia, continued from preceding administration. ROBERT\nMCCLELLAND, of Michigan, March 7, 1853.", "president": "FRANKLIN PIERCE", "dates": "MARCH 4, 1853, TO MARCH 3, 1857", "type": "presidential_administration", "description": "Administration of FRANKLIN PIERCE"}
{"body": "PRESIDENT OF THE UNITED STATES-JAMES BUCHANAN, of Pennsylvania.\nVICE PRESIDENT OF THE UNITED STATES-JOHN C. BRECKINRIDGE, of Kentucky.\nSECRETARY OF STATE-WILLIAM L. MARCY, of New York, continued from preceding administration. LEWIS CASS, of Michigan,\nMarch 6, 1857. WILLIAM HUNTER (chief clerk), ad interim, December 15, 1860. JEREMIAH S. BLACK, of Pennsylvania, December\n17, 1860.\n\nSECRETARY OF THE TREASURY-JAMES GUTHRIE, of Kentucky, continued from preceding administration. HOWELL COBB, of Georgia, March 6, 1857. ISAAC TOUCEY, of Connecticut (Secretary of the Navy), ad interim, December 10, 1860. PHILIP F. THOMAS,\nof Maryland, December 12, 1860. JOHN A. DIX, of New York, January 11, 1861; entered upon duties January 15, 1861.\n\nSECRETARY OF WAR-SAMUEL COOPER (Adjutant General, U.S. Army), ad interim, March 4, 1857. JOHN B. FLOYD, of Virginia,\nMarch 6, 1857. JOSEPH HOLT, of Kentucky (Postmaster General), ad interim, January 1, 1861. JOSEPH HOLT, of Kentucky, January 18, 1861.\n\nATTORNEY GENERAL-CALEB CUSHING, of Massachusetts, continued from preceding administration. JEREMIAH S. BLACK, of Pennsylvania, March 6, 1857; entered upon duties March 11, 1857. EDWIN M. STANTON, of Pennsylvania, December 20, 1860; entered\nupon duties December 22, 1860.\n\nPOSTMASTER GENERAL-JAMES CAMPBELL, of Pennsylvania, continued from preceding administration. AARON V. BROWN, of Tennessee, March 6, 1857. (Died March 8, 1859.) HORATIO KING, of Maine (First Assistant Postmaster General), ad interim, March\n9, 1859. JOSEPH HOLT, of Kentucky, March 14, 1859. HORATIO KING, of Maine (First Assistant Postmaster General), ad interim,\nJanuary 1, 1861. HORATIO KING, of Maine, February 12, 1861.\n\nSECRETARY OF THE NAVY-JAMES C. DOBBIN, of North Carolina, continued from preceding administration. ISAAC TOUCEY, of\n\nConnecticut, March 6, 1857.\n\nSECRETARY OF THE INTERIOR-ROBERT MCCLELLAND, of Michigan, continued from preceding administration. JACOB THOMPSON,\nof Mississippi, March 6, 1857; entered upon duties March 10, 1857. MOSES KELLY (chief clerk), ad interim, January 10, 1861.", "president": "JAMES BUCHANAN", "dates": "MARCH 4, 1857, TO MARCH 3, 1861", "type": "presidential_administration", "description": "Administration of JAMES BUCHANAN"}
{"body": "PRESIDENT OF THE UNITED STATES-ABRAHAM LINCOLN, of Illinois.\nVICE PRESIDENT OF THE UNITED STATES-HANNIBAL HAMLIN, of Maine.\nSECRETARY OF STATE-JEREMIAH S. BLACK, of Pennsylvania, continued from preceding administration. WILLIAM H. SEWARD, of\n\nNew York, March 5, 1861.\n\nSECRETARY OF THE TREASURY-JOHN A. DIX, of New York, continued from preceding administration. SALMON P. CHASE, of\nOhio, March 5, 1861; entered upon duties March 7, 1861. GEORGE HARRINGTON, of the District of Columbia (Assistant Secretary), ad interim, July 1, 1864. WILLIAM P. FESSENDEN, of Maine, July 1, 1864; entered upon duties July 5, 1864.\n\nSECRETARY OF WAR-JOSEPH HOLT, of Kentucky, continued from preceding administration. SIMON CAMERON, of Pennsylvania,\nMarch 5, 1861; entered upon duties March 11, 1861. EDWIN M. STANTON, of Pennsylvania, January 15, 1862; entered upon\nduties January 20, 1862.\n\nATTORNEY GENERAL-EDWIN M. STANTON, of Pennsylvania, continued from preceding administration. EDWARD BATES, of Missouri, March 5, 1861. JAMES SPEED, of Kentucky, December 2, 1864; entered upon duties December 5, 1864.\n\nPOSTMASTER GENERAL-HORATIO KING, of Maine, continued from preceding administration. MONTGOMERY BLAIR, of the District\nof Columbia, March 5, 1861; entered upon duties March 9, 1861. WILLIAM DENNISON, of Ohio, September 24, 1864; entered\nupon duties October 1, 1864.\n\nSECRETARY OF THE NAVY-ISAAC TOUCEY, of Connecticut, continued from preceding administration. GIDEON WELLES, of Connecticut, March 5, 1861; entered upon duties March 7, 1861.\n\nSECRETARY OF THE INTERIOR-MOSES KELLY (chief clerk), ad interim, March 4, 1861. CALEB B. SMITH, of Indiana, March 5,\n1861. JOHN P. USHER, of Indiana (Assistant Secretary), ad interim, January 1, 1863. JOHN P. USHER, of Indiana, January 8,\n1863.", "president": "ABRAHAM LINCOLN", "dates": "MARCH 4, 1861, TO MARCH 3, 1865", "type": "presidential_administration", "description": "First Administration of ABRAHAM LINCOLN"}
{"body": "PRESIDENT OF THE UNITED STATES-ABRAHAM LINCOLN, of Illinois. (Died April 15, 1865.)\nVICE PRESIDENT OF THE UNITED STATES-ANDREW JOHNSON, of Tennessee.\nSECRETARY OF STATE-WILLIAM H. SEWARD, of New York, continued from preceding administration.\nSECRETARY OF THE TREASURY-GEORGE HARRINGTON, of the District of Columbia (Assistant Secretary), ad interim, March 4,\n\n1865. HUGH MCCULLOCH, of Indiana, March 7, 1865; entered upon duties March 9, 1865.\n\nSECRETARY OF WAR-EDWIN M. STANTON, of Pennsylvania, continued from preceding administration.\nATTORNEY GENERAL-JAMES SPEED, of Kentucky, continued from preceding administration.\nPOSTMASTER GENERAL-WILLIAM DENNISON, of Ohio, continued from preceding administration.\nSECRETARY OF THE NAVY-GIDEON WELLES, of Connecticut, continued from preceding administration.\nSECRETARY OF THE INTERIOR-JOHN P. USHER, of Indiana, continued from preceding administration.", "president": "ABRAHAM LINCOLN", "dates": "MARCH 4, 1865, TO APRIL 15, 1865", "type": "presidential_administration", "description": "Second Administration of ABRAHAM LINCOLN"}
{"body": "PRESIDENT OF THE UNITED STATES-ANDREW JOHNSON, of Tennessee.\nPRESIDENT PRO TEMPORE OF THE SENATE-LAFAYETTE S. FOSTER, of Connecticut; BENJAMIN F. WADE, of Ohio.\nSECRETARY OF STATE-WILLIAM H. SEWARD, of New York, continued from preceding administration.\nSECRETARY OF THE TREASURY-HUGH MCCULLOCH, of Indiana; continued from preceding administration.\nSECRETARY OF WAR-EDWIN M. STANTON, of Pennsylvania, continued from preceding administration; suspended August 12, 1867.\nULYSSES S. GRANT (General of the Army), ad interim, August 12, 1867. EDWIN M. STANTON, of Pennsylvania, reinstated January 13, 1868, to May 26, 1868. JOHN M. SCHOFIELD, of Illinois, May 28, 1868; entered upon duties June 1, 1868.\n\nATTORNEY GENERAL-JAMES SPEED, of Kentucky, continued from preceding administration. J. HUBLEY ASHTON, of Pennsylvania\n(Assistant Attorney General), acting, July 17, 1866. HENRY STANBERRY, of Ohio, July 23, 1866. ORVILLE H. BROWNING, of Illinois (Secretary of the Interior), ad interim, March 13, 1868. WILLIAM M. EVARTS, of New York, July 15, 1868; entered upon\nduties July 20, 1868.\n\nPOSTMASTER GENERAL-WILLIAM DENNISON, of Ohio, continued from preceding administration. ALEXANDER W. RANDALL, of Wisconsin (First Assistant Postmaster General), ad interim, July 17, 1866. ALEXANDER W. RANDALL, of Wisconsin, July 25, 1866.\n\nSECRETARY OF THE NAVY-GIDEON WELLES, of Connecticut, continued from preceding administration.\nSECRETARY OF THE INTERIOR-JOHN P. USHER, of Indiana, continued from preceding administration. JAMES HARLAN, of Iowa,\n\nMay 15, 1865. ORVILLE H. BROWNING, of Illinois, July 27, 1866, to take effect September 1, 1866.", "president": "ANDREW JOHNSON", "dates": "APRIL 15, 1865, TO MARCH 3, 1869", "type": "presidential_administration", "description": "Administration of ANDREW JOHNSON"}
{"body": "PRESIDENT OF THE UNITED STATES-ULYSSES S. GRANT, of Illinois.\nVICE PRESIDENT OF THE UNITED STATES-SCHUYLER COLFAX, of Indiana.\nSECRETARY OF STATE-WILLIAM H. SEWARD, of New York, continued from preceding administration. ELIHU B. WASHBURNE, of\n\nIllinois, March 5, 1869. HAMILTON FISH, of New York, March 11, 1869; entered upon duties March 17, 1869.\n\nSECRETARY OF THE TREASURY-HUGH MCCULLOCH, of Indiana, continued from preceding administration. JOHN F. HARTLEY, of\n\nMaine (Assistant Secretary), ad interim, March 5, 1869. GEORGE S. BOUTWELL, of Massachusetts, March 11, 1869.\n\nSECRETARY OF WAR-JOHN M. SCHOFIELD, of Illinois, continued from preceding administration. JOHN A. RAWLINS, of Illinois,\nMarch 11, 1869. WILLIAM T. SHERMAN, of Ohio, September 9, 1869; entered upon duties September 11, 1869. WILLIAM W.\nBELKNAP, of Iowa, October 25, 1869; entered upon duties November 1, 1869.\n\nATTORNEY GENERAL-WILLIAM M. EVARTS, of New York, continued from preceding administration. J. HUBLEY ASHTON, of Pennsylvania (Assistant Attorney General), acting, March 5, 1869. EBENEZER R. HOAR, of Massachusetts, March 5, 1869; entered\nupon duties March 11, 1869. AMOS T. AKERMAN, of Georgia, June 23, 1870; entered upon duties July 8, 1870. GEORGE H.\nWILLIAMS, of Oregon, December 14, 1871, to take effect January 10, 1872.\n\nPOSTMASTER GENERAL-ST. JOHN B. L. SKINNER, of New York (First Assistant Postmaster General), ad interim, March 4, 1869.\n\nJOHN A. J. CRESWELL, of Maryland, March 5, 1869.\n\nSECRETARY OF THE NAVY-WILLIAM FAXON, of Connecticut (Assistant Secretary), ad interim, March 4, 1869. ADOLPH E. BORIE,\nof Pennsylvania, March 5, 1869; entered upon duties March 9, 1869. GEORGE M. ROBESON, of New Jersey, June 25, 1869.\n\nSECRETARY OF THE INTERIOR-WILLIAM T. OTTO, of Indiana (Assistant Secretary), ad interim, March 4, 1869. JACOB D. COX,\nof Ohio, March 5, 1869; entered upon duties March 9, 1869. COLUMBUS DELANO, of Ohio, November 1, 1870.", "president": "ULYSSES S. GRANT", "dates": "MARCH 4, 1869, TO MARCH 3, 1873", "type": "presidential_administration", "description": "First Administration of ULYSSES S. GRANT"}
{"body": "PRESIDENT OF THE UNITED STATES-ULYSSES S. GRANT, of Illinois.\nVICE PRESIDENT OF THE UNITED STATES-HENRY WILSON, of Massachusetts. (Died November 22, 1875.)\nPRESIDENT PRO TEMPORE OF THE SENATE-THOMAS W. FERRY, of Michigan.\nSECRETARY OF STATE-HAMILTON FISH, of New York, continued from preceding administration. HAMILTON FISH, of New York,\n\nrecommissioned March 17, 1873.\n\nSECRETARY OF THE TREASURY-GEORGE S. BOUTWELL, of Massachusetts, continued from preceding administration. WILLIAM A.\nRICHARDSON, of Massachusetts, March 17, 1873. BENJAMIN H. BRISTOW, of Kentucky, June 2, 1874; entered upon duties June\n4, 1874. CHARLES F. CONANT, of New Hampshire (Assistant Secretary), ad interim, June 21, 1876, to June 30, 1876. LOT M.\nMORRILL, of Maine, June 21, 1876; entered upon duties July 7, 1876.\n\nSECRETARY OF WAR-WILLIAM W. BELKNAP, of Iowa, continued from preceding administration. WILLIAM W. BELKNAP, of Iowa,\nrecommissioned March 17, 1873. (Resigned March 2, 1876.) GEORGE M. ROBESON, of New Jersey (Secretary of the Navy), ad\ninterim, March 2, 1876. ALPHONSO TAFT, of Ohio, March 8, 1876; entered upon duties March 11, 1876. JAMES D. CAMERON,\nof Pennsylvania, May 22, 1876; entered upon duties June 1, 1876.\n\nATTORNEY GENERAL-GEORGE H. WILLIAMS, of Oregon, continued from preceding administration. GEORGE H. WILLIAMS, of Oregon, recommissioned March 17, 1873. EDWARDS PIERREPONT, of New York, April 26, 1875, to take effect May 15, 1875.\nALPHONSO TAFT, of Ohio, May 22, 1876; entered upon duties June 1, 1876.\n\nPOSTMASTER GENERAL-JOHN A. J. CRESWELL, of Maryland, continued from preceding administration. JOHN A. J. CRESWELL,\nof Maryland, recommissioned March 17, 1873. JAMES W. MARSHALL, of Virginia, July 3, 1874; entered upon duties July 7, 1874.\nMARSHALL JEWELL, of Connecticut, August 24, 1874; entered upon duties September 1, 1874. JAMES N. TYNER, of Indiana, July\n12, 1876.\n\nSECRETARY OF THE NAVY-GEORGE M. ROBESON, of New Jersey, continued from preceding administration. GEORGE M. ROBESON,\nof New Jersey, recommissioned March 17, 1873.\n\nSECRETARY OF THE INTERIOR-COLUMBUS DELANO, of Ohio, continued from preceding administration. COLUMBUS DELANO, of\nOhio, recommissioned March 17, 1873. BENJAMIN R. COWEN, of Ohio (Assistant Secretary), ad interim, October 1, 1875. ZACHARIAH CHANDLER, of Michigan, October 19, 1875.", "president": "ULYSSES S. GRANT", "dates": "MARCH 4, 1873, TO MARCH 3, 1877", "type": "presidential_administration", "description": "Second Administration of ULYSSES S. GRANT"}
{"body": "PRESIDENT OF THE UNITED STATES-RUTHERFORD B. HAYES, of Ohio.\nVICE PRESIDENT OF THE UNITED STATES-WILLIAM A. WHEELER, of New York.\nSECRETARY OF STATE-HAMILTON FISH, of New York, continued from preceding administration. WILLIAM M. EVARTS, of New\n\nYork, March 12, 1877.\n\nSECRETARY OF THE TREASURY-LOT M. MORRILL, of Maine, continued from preceding administration. JOHN SHERMAN, of Ohio,\n\nMarch 8, 1877; entered upon duties March 10, 1877.\n\nSECRETARY OF WAR-JAMES D. CAMERON, of Pennsylvania, continued from preceding administration. GEORGE W. MCCRARY, of\n\nIowa, March 12, 1877. ALEXANDER RAMSEY, of Minnesota, December 10, 1879; entered upon duties December 12, 1879.\n\nATTORNEY GENERAL-ALPHONSO TAFT, of Ohio, continued from preceding administration. CHARLES DEVENS, of Massachusetts,\n\nMarch 12, 1877.\n\nPOSTMASTER GENERAL-JAMES N. TYNER, of Indiana, continued from preceding administration. DAVID M. KEY, of Tennessee,\nMarch 12, 1877. (Resigned June 1, 1880, but served to August 24, 1880.) HORACE MAYNARD, of Tennessee, June 2, 1880; entered upon duties August 25, 1880.\n\nSECRETARY OF THE NAVY-GEORGE M. ROBESON, of New Jersey, continued from preceding administration. RICHARD W. THOMPSON, of Indiana, March 12, 1877. ALEXANDER RAMSEY, of Minnesota (Secretary of War), ad interim, December 20, 1880. NATHAN\nGOFF, JR., of West Virginia, January 6, 1881.\n\nSECRETARY OF THE INTERIOR-ZACHARIAH CHANDLER, of Michigan, continued from preceding administration. CARL SCHURZ, of\n\nMissouri, March 12, 1877.", "president": "RUTHERFORD B. HAYES", "dates": "MARCH 4, 1877, TO MARCH 3, 1881", "type": "presidential_administration", "description": "Administration of RUTHERFORD B. HAYES"}
{"body": "PRESIDENT OF THE UNITED STATES-JAMES A. GARFIELD, of Ohio. (Died September 19, 1881.)\nVICE PRESIDENT OF THE UNITED STATES-CHESTER A. ARTHUR, of New York.\nSECRETARY OF STATE-WILLIAM M. EVARTS, of New York, continued from preceding administration. JAMES G. BLAINE, of Maine,\n\nMarch 5, 1881; entered upon duties March 7, 1881.\n\nSECRETARY OF THE TREASURY-HENRY F. FRENCH, of Massachusetts (Assistant Secretary), ad interim, March 4, 1881. WILLIAM\nWINDOM, of Minnesota, March 5, 1881; entered upon duties March 8, 1881.\n\nSECRETARY OF WAR-ALEXANDER RAMSEY, of Minnesota, continued from preceding administration. ROBERT T. LINCOLN, of Illinois,\n\nMarch 5, 1881; entered upon duties March 11, 1881.\n\nATTORNEY GENERAL-CHARLES DEVENS, of Massachusetts, continued from preceding administration. WAYNE MACVEAGH, of Pennsylvania, March 5, 1881; entered upon duties March 7, 1881.\n\nPOSTMASTER GENERAL-HORACE MAYNARD, of Tennessee, continued from preceding administration. THOMAS L. JAMES, of New\n\nYork, March 5, 1881; entered upon duties March 8, 1881.\n\nSECRETARY OF THE NAVY-NATHAN GOFF, JR., of West Virginia, continued from preceding administration. WILLIAM H. HUNT,\nof Louisiana, March 5, 1881; entered upon duties March 7, 1881.\n\nSECRETARY OF THE INTERIOR-CARL SCHURZ, of Missouri, continued from preceding administration. SAMUEL J. KIRKWOOD, of\n\nIowa, March 5, 1881; entered upon duties March 8, 1881.", "president": "JAMES A. GARFIELD", "dates": "MARCH 4, 1881, TO SEPTEMBER 19, 1881", "type": "presidential_administration", "description": "Administration of JAMES A. GARFIELD"}
{"body": "PRESIDENT OF THE UNITED STATES-CHESTER A. ARTHUR, of New York.\nPRESIDENT PRO TEMPORE OF THE SENATE-THOMAS F. BAYARD, of Delaware; DAVID DAVIS, of Illinois; GEORGE F. EDMUNDS,\nof Vermont.\n\nSECRETARY OF STATE-JAMES G. BLAINE, of Maine, continued from preceding administration. FREDERICK T. FRELINGHUYSEN, of\n\nNew Jersey, December 12, 1881; entered upon duties December 19, 1881.\n\nSECRETARY OF THE TREASURY-WILLIAM WINDOM, of Minnesota, continued from preceding administration. CHARLES J. FOLGER,\nof New York, October 27, 1881; entered upon duties November 14, 1881. (Died September 4, 1884.) CHARLES E. COON, of New\nYork (Assistant Secretary), ad interim, September 4, 1884. HENRY F. FRENCH, of Massachusetts (Assistant Secretary), ad interim, September 8, 1884. CHARLES E. COON, of New York (Assistant Secretary), ad interim, September 15, 1884. WALTER Q.\nGRESHAM, of Indiana, September 24, 1884. HENRY F. FRENCH, of Massachusetts (Assistant Secretary), ad interim, October 29,\n1884. HUGH MCCULLOCH, of Indiana, October 28, 1884; entered upon duties October 31, 1884.\nSECRETARY OF WAR-ROBERT T. LINCOLN, of Illinois, continued from preceding administration.\nATTORNEY GENERAL-WAYNE MACVEAGH, of Pennsylvania, continued from preceding administration. SAMUEL F. PHILLIPS, of\nNorth Carolina (Solicitor General), ad interim, November 14, 1881. BENJAMIN H. BREWSTER, of Pennsylvania, December 19,\n1881; entered upon duties January 3, 1882.\n\nPOSTMASTER GENERAL-THOMAS L. JAMES, of New York, continued from preceding administration. THOMAS L. JAMES, of New\nYork, recommissioned October 27, 1881; TIMOTHY O. HOWE, of Wisconsin, December 20, 1881; entered upon duties January 5,\n1982. (Died March 25, 1883.) FRANK HATTON, of Iowa (First Assistant Postmaster General), ad interim, March 26, 1883. WALTER Q. GRESHAM, of Indiana, April 3, 1883; entered upon duties April 11, 1883. FRANK HATTON, of Iowa (First Assistant Postmaster General), ad interim, September 25, 1884. FRANK HATTON, of Iowa, October 14, 1884.\n\nSECRETARY OF THE NAVY-WILLIAM H. HUNT, of Louisiana, continued from preceding administration. WILLIAM E. CHANDLER,\nof New Hampshire, April 12, 1882; entered upon duties April 17, 1882.\n\nSECRETARY OF THE INTERIOR-SAMUEL J. KIRKWOOD, of Iowa, continued from preceding administration. HENRY M. TELLER, of\n\nColorado, April 6, 1882; entered upon duties April 17, 1882.", "president": "CHESTER A. ARTHUR", "dates": "SEPTEMBER 20, 1881, TO MARCH 3, 1885", "type": "presidential_administration", "description": "Administration of CHESTER A. ARTHUR"}
{"body": "PRESIDENT OF THE UNITED STATES-GROVER CLEVELAND, of New York.\nVICE PRESIDENT OF THE UNITED STATES-THOMAS A. HENDRICKS, of Indiana. (Died November 25, 1885.)\nPRESIDENT PRO TEMPORE OF THE SENATE-JOHN SHERMAN, of Ohio; JOHN J. INGALLS, of Kansas.\nSECRETARY OF STATE-FREDERICK T. FRELINGHUYSEN, of New Jersey, continued from preceding administration. THOMAS F. BAYARD, of Delaware, March 6, 1885.\n\nSECRETARY OF THE TREASURY-HUGH MCCULLOCH, of Indiana, continued from preceding administration. DANIEL MANNING, of\n\nNew York, March 6, 1885; entered upon duties March 8, 1885. CHARLES S. FAIRCHILD, of New York, April 1, 1887.\n\nSECRETARY OF WAR-ROBERT T. LINCOLN, of Illinois, continued from preceding administration. WILLIAM C. ENDICOTT, of Massachusetts, March 6, 1885.\n\nATTORNEY GENERAL-BENJAMIN H. BREWSTER, of Pennsylvania, continued from preceding administration. AUGUSTUS H. GARLAND,\nof Arkansas, March 6, 1885; entered upon duties March 9, 1885.\n\nPOSTMASTER GENERAL-FRANK HATTON, of Iowa; continued from preceding administration. WILLIAM F. VILAS, of Wisconsin,\n\nMarch 6, 1885. DON M. DICKINSON, of Michigan, January 16, 1888.\n\nSECRETARY OF THE NAVY-WILLIAM E. CHANDLER, of New Hampshire, continued from preceding administration. WILLIAM C.\nWHITNEY, of New York, March 6, 1885.\n\nSECRETARY OF THE INTERIOR-MERRITT L. JOSLYN, of Illinois, (Assistant Secretary), ad interim, March 4, 1885. LUCIUS Q.\nC. LAMAR, of Mississippi, March 6, 1885. HENRY L. MULDROW, of Mississippi (First Assistant Secretary), ad interim, January\n11, 1888. WILLIAM F. VILAS, of Wisconsin, January 16, 1888.\n\nSECRETARY OF AGRICULTURE-NORMAN J. COLMAN, of Missouri, February 13, 1889.", "president": "GROVER CLEVELAND", "dates": "MARCH 4, 1885, TO MARCH 3, 1889", "type": "presidential_administration", "description": "First Administration of GROVER CLEVELAND"}
{"body": "PRESIDENT OF THE UNITED STATES-BENJAMIN HARRISON, of Indiana.\nVICE PRESIDENT OF THE UNITED STATES-LEVI P. MORTON, of New York.\nSECRETARY OF STATE-THOMAS F. BAYARD, of Delaware, continued from preceding administration. JAMES G. BLAINE, of Maine,\nMarch 5, 1889; entered upon duties March 7, 1889. WILLIAM F. WHARTON, of Massachusetts (Assistant Secretary), ad interim,\nJune 4, 1892. JOHN W. FOSTER, of Indiana, June 29, 1892. WILLIAM F. WHARTON, of Massachusetts (Assistant Secretary), ad\ninterim, February 23, 1893.\n\nSECRETARY OF THE TREASURY-CHARLES S. FAIRCHILD, of New York, continued from preceding administration. WILLIAM\nWINDOM, of Minnesota, March 5, 1889; entered upon duties March 7, 1889. (Died January 29, 1891.) ALLURED B. NETTLETON,\nof Minnesota (Assistant Secretary), ad interim, January 30, 1891. CHARLES FOSTER, of Ohio, February 24, 1891.\n\nSECRETARY OF WAR-WILLIAM C. ENDICOTT, of Massachusetts, continued from preceding administration. REDFIELD PROCTOR, of\nVermont, March 5, 1889. LEWIS A. GRANT, of Minnesota (Assistant Secretary), ad interim, December 6, 1891. STEPHEN B. ELKINS, of West Virginia, December 22, 1891; entered upon duties December 24, 1891.\n\nATTORNEY GENERAL-AUGUSTUS H. GARLAND, of Arkansas, continued from preceding administration. WILLIAM H. H. MILLER, of\n\nIndiana, March 5, 1889.\n\nPOSTMASTER GENERAL-DON M. DICKINSON, of Michigan, continued from preceding administration. JOHN WANAMAKER, of Pennsylvania, March 5, 1889.\n\nSECRETARY OF THE NAVY-WILLIAM C. WHITNEY, of New York, continued from preceding administration. BENJAMIN F. TRACY,\nof New York, March 5, 1889.\n\nSECRETARY OF THE INTERIOR-WILLIAM F. VILAS, of Wisconsin, continued from preceding administration. JOHN W. NOBLE, of\n\nMissouri, March 5, 1889; entered upon duties March 7, 1889.\n\nSECRETARY OF AGRICULTURE-NORMAN J. COLMAN, of Missouri, continued from preceding administration. JEREMIAH M. RUSK,\nof Wisconsin, March 5, 1889; entered upon duties March 7, 1889.", "president": "BENJAMIN HARRISON", "dates": "MARCH 4, 1889, TO MARCH 3, 1893", "type": "presidential_administration", "description": "Administration of BENJAMIN HARRISON"}
{"body": "PRESIDENT OF THE UNITED STATES-GROVER CLEVELAND, of New York.\nVICE PRESIDENT OF THE UNITED STATES-ADLAI E. STEVENSON, of Illinois.\nSECRETARY OF STATE-WILLIAM F. WHARTON, of Massachusetts (Assistant Secretary), ad interim, continued from preceding administration. WALTER Q. GRESHAM, of Illinois, March 6, 1893. (Died May 28, 1895.) EDWIN F. UHL, of Michigan (Assistant Secretary), ad interim, May 28, 1895. ALVEY A. ADEE, of the District of Columbia (Second Assistant Secretary), ad interim, May\n31, 1895. EDWIN F. UHL, of Michigan (Assistant Secretary), ad interim, June 1, 1895. RICHARD OLNEY, of Massachusetts, June\n8, 1895; entered upon duties June 10, 1895.\n\nSECRETARY OF THE TREASURY-CHARLES FOSTER, of Ohio, continued from preceding administration. JOHN G. CARLISLE, of Kentucky, March 6, 1893.\n\nSECRETARY OF WAR-STEPHEN B. ELKINS, of West Virginia, continued from preceding administration. DANIEL S. LAMONT, of New\n\nYork, March 6, 1893.\n\nATTORNEY GENERAL-WILLIAM H. H. MILLER, of Indiana, continued from preceding administration. RICHARD OLNEY, of Massachusetts, March 6, 1893. JUDSON HARMON, of Ohio, June 8, 1895; entered upon duties June 11, 1895.\n\nPOSTMASTER GENERAL-JOHN WANAMAKER, of Pennsylvania, continued from preceding administration. WILSON S. BISSELL, of\n\nNew York, March 6, 1893. WILLIAM L. WILSON, of West Virginia, March 1, 1895; entered upon duties April 4, 1895.\n\nSECRETARY OF THE NAVY-BENJAMIN F. TRACY, of New York, continued from preceding administration. HILARY A. HERBERT,\nof Alabama, March 6, 1893.\n\nSECRETARY OF THE INTERIOR-JOHN W. NOBLE, of Missouri, continued from preceding administration. HOKE SMITH, of Georgia,\nMarch 6, 1893. JOHN M. REYNOLDS, of Pennsylvania (Assistant Secretary), ad interim, September 1, 1896. DAVID R. FRANCIS,\nof Missouri, September 1, 1896; entered upon duties September 4, 1896.\n\nSECRETARY OF AGRICULTURE-JEREMIAH M. RUSK, of Wisconsin, continued from preceding administration. JULIUS STERLING\nMORTON, of Nebraska, March 6, 1893.", "president": "GROVER CLEVELAND", "dates": "MARCH 4, 1893, TO MARCH 3, 1897", "type": "presidential_administration", "description": "Second Administration of GROVER CLEVELAND"}
{"body": "PRESIDENT OF THE UNITED STATES-WILLIAM MCKINLEY, of Ohio.\nVICE PRESIDENT OF THE UNITED STATES-GARRET A. HOBART, of New Jersey. (Died November 21, 1899.)\nPRESIDENT PRO TEMPORE OF THE SENATE-WILLIAM P. FRYE, of Maine.\nSECRETARY OF STATE-RICHARD OLNEY, of Massachusetts, continued from preceding administration. JOHN SHERMAN, of Ohio,\nMarch 5, 1897. WILLIAM R. DAY, of Ohio, April 26, 1898; entered upon duties April 28, 1898. ALVEY A. ADEE (Second Assistant\nSecretary), ad interim, September 17, 1898. JOHN HAY, of the District of Columbia, September 20, 1898; entered upon duties\nSeptember 30, 1898.\n\nSECRETARY OF THE TREASURY-JOHN G. CARLISLE, of Kentucky, continued from preceding administration. LYMAN J. GAGE, of\n\nIllinois, March 5, 1897.\n\nSECRETARY OF WAR-DANIEL S. LAMONT, of New York, continued from preceding administration. RUSSELL A. ALGER, of Michigan,\n\nMarch 5, 1897. ELIHU ROOT, of New York, August 1, 1899.\n\nATTORNEY GENERAL-JUDSON HARMON, of Ohio, continued from preceding administration. JOSEPH MCKENNA, of California,\nMarch 5, 1897; entered upon duties March 7, 1897. JOHN K. RICHARDS, of Ohio, (Solicitor General), ad interim, January 26,\n1898. JOHN W. GRIGGS, of New Jersey, January 25, 1898; entered upon duties February 1, 1898.\n\nPOSTMASTER GENERAL-WILLIAM L. WILSON, of West Virginia, continued from preceding administration. JAMES A. GARY, of\n\nMaryland, March 5, 1897. CHARLES EMORY SMITH, of Pennsylvania, April 21, 1898.\n\nSECRETARY OF THE NAVY-HILARY A. HERBERT, of Alabama, continued from preceding administration. JOHN D. LONG, of Massachusetts, March 5, 1897.\n\nSECRETARY OF THE INTERIOR-DAVID R. FRANCIS, of Missouri, continued from preceding administration. CORNELIUS N. BLISS,\nof New York, March 5, 1897. ETHAN A. HITCHCOCK, of Missouri, December 21, 1898; entered upon duties February 20, 1899.\nSECRETARY OF AGRICULTURE-JULIUS STERLING MORTON, of Nebraska, continued from preceding administration. JAMES WILSON, of Iowa, March 5, 1897.", "president": "WILLIAM McKINLEY", "dates": "MARCH 4, 1897, TO MARCH 3, 1901", "type": "presidential_administration", "description": "First Administration of WILLIAM McKINLEY"}
{"body": "PRESIDENT OF THE UNITED STATES-WILLIAM MCKINLEY, of Ohio. (Died September 14, 1901.)\nVICE PRESIDENT OF THE UNITED STATES-THEODORE ROOSEVELT, of New York.\nSECRETARY OF STATE-JOHN HAY, of the District of Columbia, continued from preceding administration. JOHN HAY, of the District of Columbia, recommissioned March 5, 1901.\n\nSECRETARY OF THE TREASURY-LYMAN J. GAGE, of Illinois, continued from preceding administration. LYMAN J. GAGE, of Illinois, recommissioned March 5, 1901.\n\nSECRETARY OF WAR-ELIHU ROOT, of New York, continued from preceding administration. ELIHU ROOT, of New York, recommissioned March 5, 1901.\n\nATTORNEY GENERAL-JOHN W. GRIGGS, of New Jersey, continued from preceding administration. JOHN W. GRIGGS, of New Jersey, recommissioned March 5, 1901. JOHN K. RICHARDS, of Ohio (Solicitor General), ad interim, April 1, 1901. PHILANDER C.\nKNOX, of Pennsylvania, April 5, 1901; entered upon duties April 10, 1901.\n\nPOSTMASTER GENERAL-CHARLES EMORY SMITH, of Pennsylvania, continued from preceding administration. CHARLES EMORY\nSMITH, of Pennsylvania, recommissioned March 5, 1901.\n\nSECRETARY OF THE NAVY-JOHN D. LONG, of Massachusetts, continued from preceding administration. JOHN D. LONG, of Massachusetts, recommissioned March 5, 1901.\n\nSECRETARY OF THE INTERIOR-ETHAN A. HITCHCOCK, of Missouri, continued from preceding administration. ETHAN A. HITCHCOCK, of Missouri, recommissioned March 5, 1901.\n\nSECRETARY OF AGRICULTURE-JAMES WILSON, of Iowa, continued from preceding administration. JAMES WILSON, of Iowa, recommissioned March 5, 1901.", "president": "WILLIAM McKINLEY", "dates": "MARCH 4, 1901, TO SEPTEMBER 14, 1901", "type": "presidential_administration", "description": "Second Administration of WILLIAM McKINLEY"}
{"body": "PRESIDENT OF THE UNITED STATES-THEODORE ROOSEVELT, of New York.\nPRESIDENT PRO TEMPORE OF THE SENATE-WILLIAM P. FRYE, of Maine.\nSECRETARY OF STATE-JOHN HAY, of the District of Columbia, continued from preceding administration.\nSECRETARY OF THE TREASURY-LYMAN J. GAGE, of Illinois, continued from preceding administration. LESLIE M. SHAW, of Iowa,\n\nJanuary 9, 1902; entered upon duties February 1, 1902.\n\nSECRETARY OF WAR-ELIHU ROOT, of New York, continued from preceding administration. WILLIAM H. TAFT, of Ohio, January\n\n11, 1904, to take effect February 1, 1904.\n\nATTORNEY GENERAL-PHILANDER C. KNOX, of Pennsylvania, continued from preceding administration. PHILANDER C. KNOX, of\n\nPennsylvania, recommissioned December 16, 1901. WILLIAM H. MOODY, of Massachusetts, July 1, 1904.\n\nPOSTMASTER GENERAL-CHARLES EMORY SMITH, of Pennsylvania, continued from preceding administration. HENRY C. PAYNE, of\n\nWisconsin, January 9, 1902. ROBERT J. WYNNE, of Pennsylvania, October 10, 1904.\n\nSECRETARY OF THE NAVY-JOHN D. LONG, of Massachusetts, continued from preceding administration. WILLIAM H. MOODY, of\n\nMassachusetts, April 29, 1902; entered upon duties May 1, 1902. PAUL MORTON, of Illinois, July 1, 1904.\n\nSECRETARY OF THE INTERIOR-ETHAN A. HITCHCOCK, of Missouri, continued from preceding administration.\nSECRETARY OF AGRICULTURE-JAMES WILSON, of Iowa, continued from preceding administration.\nSECRETARY OF COMMERCE AND LABOR-GEORGE B. CORTELYOU, of New York, February 16, 1903. VICTOR H. METCALF, of\n\nCalifornia, July 1, 1904.", "president": "THEODORE ROOSEVELT", "dates": "SEPTEMBER 14, 1901, TO MARCH 3, 1905", "type": "presidential_administration", "description": "First Administration of THEODORE ROOSEVELT"}
{"body": "PRESIDENT OF THE UNITED STATES-THEODORE ROOSEVELT, of New York.\nVICE PRESIDENT OF THE UNITED STATES-CHARLES WARREN FAIRBANKS, of Indiana.\nPRESIDENT PRO TEMPORE OF THE SENATE-WILLIAM P. FRYE, of Maine\nSECRETARY OF STATE-JOHN HAY, of the District of Columbia, continued from preceding administration. JOHN HAY, of the District of Columbia, recommissioned March 6, 1905. (Died July 1, 1905.) FRANCIS B. LOOMIS, of Ohio (Assistant Secretary), ad\ninterim, July 1, 1905, to July 18, 1905. ELIHU ROOT, of New York, July 7, 1905; entered upon duties July 19, 1905. ROBERT\nBACON, of New York, January 27, 1909.\n\nSECRETARY OF THE TREASURY-LESLIE M. SHAW, of Iowa, continued from preceding administration. LESLIE M. SHAW, of Iowa,\n\nrecommissioned March 6, 1905. GEORGE B. CORTELYOU, of New York, January 15, 1907; to take effect March 4, 1907.\n\nSECRETARY OF WAR-WILLIAM H. TAFT, of Ohio, continued from preceding administration. WILLIAM H. TAFT, of Ohio, recommissioned March 6, 1905. LUKE E. WRIGHT, of Tennessee, June 29, 1908; entered upon duties July 1, 1908.\n\nATTORNEY GENERAL-WILLIAM H. MOODY, of Massachusetts, continued from preceding administration. WILLIAM H. MOODY, of\nMassachusetts, recommissioned March 6, 1905. CHARLES J. BONAPARTE, of Maryland, December 12, 1906; entered upon duties\nDecember 17, 1906.\n\nPOSTMASTER GENERAL-ROBERT J. WYNNE, of Pennsylvania, continued from preceding administration. GEORGE B. CORTELYOU,\nof New York, March 6, 1905. GEORGE VON L. MEYER, of Massachusetts, January 15, 1907, to take effect March 4, 1907.\n\nSECRETARY OF THE NAVY-PAUL MORTON, of Illinois, continued from preceding administration. PAUL MORTON, of Illinois recommissioned March 6, 1905. CHARLES J. BONAPARTE, of Maryland, July 1, 1905. VICTOR H. METCALF, of California, December\n12, 1906; entered upon duties December 17, 1906. TRUMAN H. NEWBERRY, of Michigan, December 1, 1908.\n\nSECRETARY OF THE INTERIOR-ETHAN A. HITCHCOCK, of Missouri, continued from preceding administration. ETHAN A. HITCHCOCK, of Missouri, recommissioned March 6, 1905. JAMES R. GARFIELD, of Ohio, January 15, 1907, to take effect March 4, 1907.\nSECRETARY OF AGRICULTURE-JAMES WILSON, of Iowa, continued from preceding administration. JAMES WILSON, of Iowa, recommissioned March 6, 1905.\n\nSECRETARY OF COMMERCE AND LABOR-VICTOR H. METCALF, of California, continued from preceding administration. VICTOR\nH. METCALF, of California, recommissioned March 6, 1905. OSCAR S. STRAUS, of New York, December 12, 1906; entered upon\nduties December 17, 1906.", "president": "THEODORE ROOSEVELT", "dates": "MARCH 4, 1905, TO MARCH 3, 1909", "type": "presidential_administration", "description": "Second Administration of THEODORE ROOSEVELT"}
{"body": "PRESIDENT OF THE UNITED STATES-WILLIAM H. TAFT, of Ohio.\nVICE PRESIDENT OF THE UNITED STATES-JAMES S. SHERMAN, of New York. (Died October 30, 1912.)\nPRESIDENT PRO TEMPORE OF THE SENATE-WILLIAM P. FRYE, of Maine. (Resigned April 27, 1911.) JACOB H. GALLINGER,\nof New Hampshire, and AUGUSTUS O. BACON, of Georgia, alternating.\n\nSECRETARY OF STATE-ROBERT BACON, of New York, continued from preceding administration. PHILANDER C. KNOX, of Pennsylvania, March 5, 1909.\n\nSECRETARY OF THE TREASURY-GEORGE B. CORTELYOU, of New York, continued from preceding administration. FRANKLIN\nMACVEAGH, of Illinois, March 5, 1909; entered upon duties March 8, 1909.\n\nSECRETARY OF WAR-LUKE E. WRIGHT, of Tennessee, continued from preceding administration. JACOB M. DICKINSON, of Tennessee, March 5, 1909; entered upon duties March 12, 1909. HENRY L. STIMSON, of New York, May 16, 1911; entered upon\nduties May 22, 1911.\n\nATTORNEY GENERAL-CHARLES J. BONAPARTE, of Maryland, continued from preceding administration. GEORGE W. WICKERSHAM,\nof New York, March 5, 1909.\n\nPOSTMASTER GENERAL-GEORGE VON L. MEYER, of Massachusetts, continued from preceding administration. FRANK H. HITCHCOCK, of Massachusetts, March 5, 1909.\n\nSECRETARY OF THE NAVY-TRUMAN H. NEWBERRY, of Michigan, continued from preceding administration. GEORGE VON L.\nMEYER, of Massachusetts, March 5, 1909.\n\nSECRETARY OF THE INTERIOR-JAMES R. GARFIELD, of Ohio, continued from preceding administration. RICHARD A. BALLINGER,\nof Washington, March 5, 1909. WALTER LOWRIE FISHER, of Illinois, March 7, 1911.\n\nSECRETARY OF AGRICULTURE-JAMES WILSON, of Iowa, continued from preceding administration. JAMES WILSON, of Iowa, recommissioned March 5, 1909.\n\nSECRETARY OF COMMERCE AND LABOR-OSCAR S. STRAUS, of New York, continued from preceding administration. CHARLES\nNAGEL, of Missouri, March 5, 1909.", "president": "WILLIAM H. TAFT", "dates": "MARCH 4, 1909, TO MARCH 3, 1913", "type": "presidential_administration", "description": "Administration of WILLIAM H. TAFT"}
{"body": "PRESIDENT OF THE UNITED STATES-WOODROW WILSON, of New Jersey\nVICE PRESIDENT OF THE UNITED STATES-THOMAS R. MARSHALL, of Indiana.\nSECRETARY OF STATE-PHILANDER C. KNOX, of Pennsylvania, continued from preceding administration. WILLIAM JENNINGS\nBRYAN, of Nebraska, March 5, 1913. ROBERT LANSING, of New York (counselor), ad interim, June 9, 1915. ROBERT LANSING,\nof New York, June 23, 1915.\n\nSECRETARY OF THE TREASURY-FRANKLIN MACVEAGH, of Illinois, continued from preceding administration. WILLIAM GIBBS\nMCADOO, of New York, March 5, 1913; entered upon duties March 6, 1913.\n\nSECRETARY OF WAR-HENRY L. STIMSON, of New York, continued from preceding administration. LINDLEY M. GARRISON, of New\nJersey, March 5, 1913. HUGH L. SCOTT (United States Army), ad interim, February 12, 1916; served from February 11 to\nMarch 8, 1916. NEWTON D. BAKER, of Ohio, March 7, 1916; entered upon duties March 9, 1916.\n\nATTORNEY GENERAL-GEORGE W. WICKERSHAM, of New York, continued\n\nfrom preceding administration. JAMES CLARK\nMCREYNOLDS, of Tennessee, March 5, 1913; entered upon duties March 6, 1913. THOMAS WATT GREGORY, of Texas, August 29,\n1914; entered upon duties September 3, 1914.\n\nPOSTMASTER GENERAL-FRANK H. HITCHCOCK, of Massachusetts, continued from preceding administration. ALBERT SIDNEY\nBURLESON, of Texas, March 5, 1913.\n\nSECRETARY OF THE NAVY-GEORGE VON L. MEYER, of Massachusetts, continued from preceding administration. JOSEPHUS DANIELS, of North Carolina, March 5, 1913.\n\nSECRETARY OF THE INTERIOR-WALTER LOWRIE FISHER, of Illinois, continued from preceding administration. FRANKLIN KNIGHT\nLANE, of California, March 5, 1913.\n\nSECRETARY OF AGRICULTURE-JAMES WILSON, of Iowa, continued from preceding administration. DAVID FRANKLIN HOUSTON,\nof Missouri, March 5, 1913; entered upon duties March 6, 1913.\n\nSECRETARY OF COMMERCE-CHARLES NAGEL, of Missouri (Secretary of Commerce and Labor), continued from preceding administration. WILLIAM C. REDFIELD, of New York, March 5, 1913.\n\nSECRETARY OF LABOR-CHARLES NAGEL, of Missouri (Secretary of Commerce and Labor), continued from preceding administration. WILLIAM BAUCHOP WILSON, of Pennsylvania, March 5, 1913.", "president": "WOODROW WILSON", "dates": "MARCH 4, 1913, TO MARCH 3, 1917", "type": "presidential_administration", "description": "First Administration of WOODROW WILSON"}
{"body": "PRESIDENT OF THE UNITED STATES-WOODROW WILSON, of New Jersey.\nVICE PRESIDENT OF THE UNITED STATES-THOMAS R. MARSHALL, of Indiana.\nSECRETARY OF STATE-ROBERT LANSING, of New York, continued from preceding administration. FRANK L. POLE, of New York\n(Under Secretary), ad interim, February 14, 1920, to March 13, 1920. BAINBRIDGE COLBY, of New York, March 22, 1920; entered upon duties March 23, 1920.\n\nSECRETARY OF THE TREASURY-WILLIAM GIBBS MCADOO, of New York, continued from preceding administration. CARTER\nGLASS, of Virginia, December 6, 1918; entered upon duties December 16, 1918. DAVID F. HOUSTON, of Missouri, January 31,\n1920; entered upon duties February 2, 1920.\n\nSECRETARY OF WAR-NEWTON D. BAKER, of Ohio, continued from preceding administration.\nATTORNEY GENERAL-THOMAS WATT GREGORY, of Texas, continued from preceding administration. A. MITCHELL PALMER, of\n\nPennsylvania, March 5, 1919.\n\nPOSTMASTER GENERAL-ALBERT SIDNEY BURLESON, of Texas, continued\n\nfrom preceding administration. ALBERT SIDNEY\nBURLESON, of Texas, recommissioned January 24, 1918.\n\nSECRETARY OF THE NAVY-JOSEPHUS DANIELS, of North Carolina, continued from preceding administration.\nSECRETARY OF THE INTERIOR-FRANKLIN KNIGHT LANE, of California, continued from preceding administration. JOHN BARTON\nPAYNE, of Illinois, February 28, 1920; entered upon duties March 13, 1920.\n\nSECRETARY OF AGRICULTURE-DAVID FRANKLIN HOUSTON, of Missouri, continued from preceding administration. EDWIN T. MEREDITH, of Iowa, January 31, 1920; entered upon duties February 2, 1920.\n\nSECRETARY OF COMMERCE-WILLIAM C. REDFIELD, of New York, continued from preceding administration. JOSHUA WILLIS ALEXANDER, of Missouri, December 11, 1919; entered upon duties December 16, 1919.\n\nSECRETARY OF LABOR-WILLIAM BAUCHOP WILSON, of Pennsylvania, continued from preceding administration.", "president": "WOODROW WILSON", "dates": "MARCH 4, 1917, TO MARCH 3, 1921", "type": "presidential_administration", "description": "Second Administration of WOODROW WILSON"}
{"body": "PRESIDENT OF THE UNITED STATES-WARREN G. HARDING, of Ohio. (Died August 2, 1923.)\nVICE PRESIDENT OF THE UNITED STATES-CALVIN COOLIDGE, of Massachusetts.\nSECRETARY OF STATE-BAINBRIDGE COLBY, of New York, continued from preceding administration. CHARLES EVANS HUGHES, of\n\nNew York, March 4, 1921; entered upon duties March 5, 1921.\n\nSECRETARY OF THE TREASURY-DAVID F. HOUSTON, of Missouri, continued from preceding administration. ANDREW W. MELLON,\nof Pennsylvania, March 4, 1921; entered upon duties March 5, 1921.\n\nSECRETARY OF WAR-NEWTON D. BAKER, of Ohio, continued from preceding administration. JOHN W. WEEKS, of Massachusetts,\n\nMarch 5, 1921.\n\nATTORNEY GENERAL-A. MITCHELL PALMER, of Pennsylvania, continued from preceding administration. HARRY M. DAUGHERTY,\nof Ohio, March 5, 1921.\n\nPOSTMASTER GENERAL-ALBERT SIDNEY BURLESON, of Texas, continued from preceding administration. WILL H. HAYS, of Indiana, March 5, 1921. HUBERT WORK, of Colorado, March 4, 1922. HARRY S. NEW, of Indiana, February 27, 1923; entered upon\nduties March 5, 1923.\n\nSECRETARY OF THE NAVY-JOSEPHUS DANIELS, of North Carolina, continued from preceding administration. EDWIN DENBY, of\n\nMichigan, March 5, 1921.\n\nSECRETARY OF THE INTERIOR-JOHN BARTON PAYNE, of Illinois, continued from preceding administration. ALBERT B. FALL, of\n\nNew Mexico, March 5, 1921. HUBERT WORK, of Colorado, February 27, 1923; entered upon duties March 5, 1923.\n\nSECRETARY OF AGRICULTURE-EDWIN T. MEREDITH, of Iowa, continued from preceding administration. HENRY C. WALLACE, of\n\nIowa, March 5, 1921.\n\nSECRETARY OF COMMERCE-JOSHUA WILLIS ALEXANDER, of Missouri, continued from preceding administration. HERBERT C. HOOVER, of California, March 5, 1921.\n\nSECRETARY OF LABOR-WILLIAM BAUCHOP WILSON, of Pennsylvania, continued from preceding administration. JAMES J. DAVIS,\nof Pennsylvania, March 5, 1921.", "president": "WARREN G. HARDING", "dates": "MARCH 4, 1921, TO AUGUST 2, 1923", "type": "presidential_administration", "description": "Administration of WARREN G. HARDING"}
{"body": "PRESIDENT OF THE UNITED STATES-CALVIN COOLIDGE, of Massachusetts.\nPRESIDENT PRO TEMPORE OF THE SENATE-ALBERT B. CUMMINS, of Iowa.\nSECRETARY OF STATE-CHARLES EVANS HUGHES, of New York, continued from preceding administration.\nSECRETARY OF THE TREASURY-ANDREW W. MELLON, of Pennsylvania, continued from preceding administration.\nSECRETARY OF WAR-JOHN W. WEEKS, of Massachusetts, continued from preceding administration.\nATTORNEY GENERAL-HARRY M. DAUGHERTY, of Ohio, continued from preceding administration. HARLAN F. STONE, of New York,\n\nApril 7, 1924; entered upon duties April 9, 1924.\n\nPOSTMASTER GENERAL-HARRY S. NEW, of Indiana, continued from preceding administration.\nSECRETARY OF THE NAVY-EDWIN DENBY, of Michigan, continued from preceding administration. CURTIS D. WILBUR, of California, March 18, 1924.\n\nSECRETARY OF THE INTERIOR-HUBERT WORK, of Colorado, continued from preceding administration.\nSECRETARY OF AGRICULTURE-HENRY C. WALLACE, of Iowa, continued from preceding administration. (Died October 25, 1924.)\nHOWARD M. GORE, of West Virginia (Assistant Secretary), ad interim, October 26, 1924, to November 22, 1924. HOWARD M.\nGORE, of West Virginia, November 21, 1924; entered upon duties November 22, 1924.\n\nSECRETARY OF COMMERCE-HERBERT C. HOOVER, of California, continued from preceding administration.\nSECRETARY OF LABOR-JAMES J. DAVIS, of Pennsylvania, continued from preceding administration.", "president": "CALVIN COOLIDGE", "dates": "AUGUST 3, 1923, TO MARCH 3, 1925", "type": "presidential_administration", "description": "First Administration of CALVIN COOLIDGE"}
{"body": "PRESIDENT OF THE UNITED STATES-CALVIN COOLIDGE, of Massachusetts.\nVICE PRESIDENT OF THE UNITED STATES-CHARLES G. DAWES, of Illinois.\nSECRETARY OF STATE-CHARLES EVANS HUGHES, of New York, continued from preceding administration. FRANK B. KELLOGG,\nof Minnesota, February 16, 1925; entered upon duties March 5, 1925.\n\nSECRETARY OF THE TREASURY-ANDREW W. MELLON, of Pennsylvania, continued from preceding administration.\nSECRETARY OF WAR-JOHN W. WEEKS, of Massachusetts, continued from preceding administration. DWIGHT F. DAVIS, of Missouri,\n\nOctober 13, 1925; entered upon duties October 14, 1925.\n\nATTORNEY GENERAL-JAMES M. BECK, of Pennsylvania (Solicitor General), ad interim, March 4, 1925, to March 16, 1925. JOHN\nG. SARGENT, of Vermont, March 17, 1925; entered upon duties March 18, 1925.\n\nPOSTMASTER GENERAL-HARRY S. NEW, of Indiana, continued from preceding administration. HARRY S. NEW, of Indiana, recommissioned March 5, 1925.\n\nSECRETARY OF THE NAVY-CURTIS D. WILBUR, of California, continued from preceding administration.\nSECRETARY OF THE INTERIOR-HUBERT WORK, of Colorado, continued from preceding administration. ROY O. WEST, of Illinois,\n\nad interim, July 25, 1928, to January 21, 1929. ROY O. WEST, January 21, 1929.\n\nSECRETARY OF AGRICULTURE-HOWARD M. GORE, of West Virginia, continued from preceding administration. WILLIAM M.\nJARDINE, of Kansas, February 18, 1925; entered upon duties March 5, 1925.\n\nSECRETARY OF COMMERCE-HERBERT C. HOOVER, of California, continued from preceding administration. WILLIAM F. WHITING,\nof Massachusetts, ad interim, August 21, 1928, to December 1, 1928. WILLIAM F. WHITING, December 11, 1928.\n\nSECRETARY OF LABOR-JAMES J. DAVIS, of Pennsylvania, continued from preceding administration.", "president": "CALVIN COOLIDGE", "dates": "MARCH 4, 1925, TO MARCH 3, 1929", "type": "presidential_administration", "description": "Second Administration of CALVIN COOLIDGE"}
{"body": "PRESIDENT OF THE UNITED STATES-HERBERT C. HOOVER, of California.\nVICE PRESIDENT OF THE UNITED STATES-CHARLES CURTIS, of Kansas.\nSECRETARY OF STATE-FRANK B. KELLOGG, of Minnesota, continued from preceding administration. HENRY L. STIMSON, of New\n\nYork, March 4, 1929; entered upon duties March 29, 1929.\n\nSECRETARY OF THE TREASURY-ANDREW W. MELLON, of Pennsylvania, continued from preceding administration. OGDEN L.\nMILLS, of New York, February 10, 1932; entered upon duties February 13, 1932.\n\nSECRETARY OF WAR-DWIGHT F. DAVIS, of Missouri, continued from preceding administration. JAMES W. GOOD, of Illinois, March\n\n5, 1929; entered upon duties March 6, 1929. PATRICK J. HURLEY, of Oklahoma, December 9, 1929.\n\nATTORNEY GENERAL-JAMES. G. SARGENT, of Vermont, continued from preceding administration. JAMES DEWITT MITCHELL, of\n\nMinnesota, March 5, 1929; entered upon duties March 6, 1929.\n\nPOSTMASTER GENERAL-HARRY S. NEW, of Indiana, continued from preceding administration. WALTER F. BROWN, of Ohio, March\n\n5, 1929; entered upon duties March 6, 1929.\n\nSECRETARY OF THE NAVY-CURTIS D. WILBUR, of California, continued from preceding administration. CHARLES F. ADAMS, of\n\nMassachusetts, March 5, 1929.\n\nSECRETARY OF THE INTERIOR-ROY O. WEST, of Illinois, continued from preceding administration. RAY L. WILBUR, of California, March 5, 1929.\n\nSECRETARY OF AGRICULTURE-WILLIAM M. JARDINE, of Kansas, continued from preceding administration. ARTHUR M. HYDE,\nof Missouri, March 5, 1929; entered upon duties March 6, 1929.\n\nSECRETARY OF COMMERCE-WILLIAM F. WHITING, of Massachusetts, continued from preceding administration. ROBERT P. LAMONT, of Illinois, March 5, 1929. ROY D. CHAPIN, of Michigan, ad interim, August 8, 1932, to December 14, 1932. ROY D.\nCHAPIN, of Michigan, December 14, 1932.\n\nSECRETARY OF LABOR-JAMES J. DAVIS, of Pennsylvania, continued from preceding administration. WILLIAM N. DOAK, of Virginia, December 8, 1930; entered upon duties December 9, 1930.", "president": "HERBERT C. HOOVER", "dates": "MARCH 4, 1929, TO MARCH 3, 1933", "type": "presidential_administration", "description": "Administration of HERBERT C. HOOVER"}
{"body": "PRESIDENT OF THE UNITED STATES-FRANKLIN DELANO ROOSEVELT, of New York.\nVICE PRESIDENT OF THE UNITED STATES-JOHN N. GARNER, of Texas.\nSECRETARY OF STATE-CORDELL HULL, of Tennessee, March 4, 1933.\nSECRETARY OF THE TREASURY-WILLIAM H. WOODIN, of New York, March 4, 1933. HENRY MORGENTHAU, JR., of New York\n(Under Secretary), ad interim, January 1, 1934, to January 8, 1934. HENRY MORGENTHAU, JR., of New York, January 8, 1934.\n\nSECRETARY OF WAR-GEORGE H. DERN, of Utah, March 4, 1933.\nATTORNEY GENERAL-HOMER S. CUMMINGS, of Connecticut, March 4, 1933.\nPOSTMASTER GENERAL-JAMES A. FARLEY, of New York, March 4, 1933.\nSECRETARY OF THE NAVY-CLAUDE A. SWANSON, of Virginia, March 4, 1933.\nSECRETARY OF THE INTERIOR-HAROLD L. ICKES, of Illinois, March 4, 1933.\nSECRETARY OF AGRICULTURE-HENRY A. WALLACE, of Iowa, March 4, 1933.\nSECRETARY OF COMMERCE-DANIEL C. ROPER, of South Carolina, March 4, 1933.\nSECRETARY OF LABOR-FRANCES PERKINS, of New York, March 4, 1933.", "president": "FRANKLIN DELANO ROOSEVELT", "dates": "MARCH 4, 1933, TO JANUARY 20, 1937", "type": "presidential_administration", "description": "First Administration of FRANKLIN DELANO ROOSEVELT"}
{"body": "PRESIDENT OF THE UNITED STATES-FRANKLIN DELANO ROOSEVELT, of New York.\nVICE PRESIDENT OF THE UNITED STATES-JOHN N. GARNER, of Texas.\nSECRETARY OF STATE-CORDELL HULL, of Tennessee, continued from preceding administration.\nSECRETARY OF THE TREASURY-HENRY MORGENTHAU, JR., of New York, continued from preceding administration.\nSECRETARY OF WAR-GEORGE H. DERN, of Utah, continued from preceding administration. (Died August 27, 1936.) HARRY H.\nWOODRING, of Kansas (Assistant Secretary), ad interim, September 25, 1936, to May 6, 1937. HARRY H. WOODRING, of Kansas,\nMay 6, 1937. HENRY L. STIMSON, of New York, July 10, 1940.\n\nATTORNEY GENERAL-HOMER S. CUMMINGS, of Connecticut, continued from preceding administration. FRANK MURPHY, of Michigan, ad interim, January 2, 1939, to January 17, 1939. FRANK MURPHY, of Michigan, January 17, 1939. ROBERT H. JACKSON,\nof New York, January 18, 1940.\n\nPOSTMASTER GENERAL-JAMES A. FARLEY, of New York, continued from preceding administration. JAMES A. FARLEY, of New\n\nYork, recommissioned January 22, 1937. FRANK C. WALKER, of Pennsylvania, September 10, 1940.\n\nSECRETARY OF THE NAVY-CLAUDE A. SWANSON, of Virginia, continued from preceding administration. (Died July 7, 1939.)\nCHARLES EDISON, of New Jersey, Acting Secretary from August 5, 1939, to December 30, 1939. CHARLES EDISON, of New Jersey\n(Assistant Secretary), ad interim, December 30, 1939, to January 11, 1940. CHARLES EDISON, of New Jersey, January 11, 1940.\nFRANK KNOX, of Illinois, July 10, 1940.\n\nSECRETARY OF THE INTERIOR-HAROLD L. ICKES, of Illinois, continued from preceding administration.\nSECRETARY OF AGRICULTURE-HENRY A. WALLACE, of Iowa, continued from preceding administration. CLAUDE R. WICKARD, of\n\nIndiana, August 27, 1940; entered upon duties September 5, 1940.\n\nSECRETARY OF COMMERCE-DANIEL C. ROPER, of South Carolina, continued from preceding administration. HARRY L. HOPKINS,\nof New York, ad interim, December 24, 1938, to January 23, 1939. HARRY L. HOPKINS, of New York, January 23, 1939. JESSE\nH. JONES, of Texas, September 16, 1940; entered upon duties September 19, 1940.\n\nSECRETARY OF LABOR-FRANCES PERKINS, of New York, continued from preceding administration.", "president": "FRANKLIN DELANO ROOSEVELT", "dates": "JANUARY 20, 1937, TO JANUARY 20, 1941", "type": "presidential_administration", "description": "Second Administration of FRANKLIN DELANO ROOSEVELT"}
{"body": "PRESIDENT OF THE UNITED STATES-FRANKLIN DELANO ROOSEVELT, of New York.\nVICE PRESIDENT OF THE UNITED STATES-HENRY A. WALLACE, of Iowa.\nSECRETARY OF STATE-CORDELL HULL, of Tennessee, continued from preceding administration. EDWARD R. STETTINIUS, of Virginia, November 30, 1944; entered upon duties December 1, 1944.\n\nSECRETARY OF THE TREASURY-HENRY MORGENTHAU, JR., of New York, continued from preceding administration.\nSECRETARY OF WAR-HENRY L. STIMSON, of New York, continued from preceding administration.\nATTORNEY GENERAL-ROBERT H. JACKSON, of New York, continued from preceding administration. FRANCIS BIDDLE, of Pennsylvania, September 5, 1941.\n\nPOSTMASTER GENERAL-FRANK C. WALKER, of Pennsylvania, continued from preceding administration. FRANK C. WALKER, of\n\nPennsylvania, recommissioned January 27, 1941.\n\nSECRETARY OF THE NAVY-FRANK KNOX, of Illinois, continued from preceding administration. (Died April 28, 1944.) JAMES V.\nFORRESTAL, of New York, May 18, 1944.\n\nSECRETARY OF THE INTERIOR-HAROLD L. ICKES, of Illinois, continued from preceding administration.\nSECRETARY OF AGRICULTURE-CLAUDE R. WICKARD, of Indiana, continued from preceding administration.\nSECRETARY OF COMMERCE-JESSE H. JONES, of Texas, continued from preceding administration.\nSECRETARY OF LABOR-FRANCES PERKINS, of New York, continued from preceding administration.", "president": "FRANKLIN DELANO ROOSEVELT", "dates": "JANUARY 20, 1941, TO JANUARY 20, 1945", "type": "presidential_administration", "description": "Third Administration of FRANKLIN DELANO ROOSEVELT"}
{"body": "PRESIDENT OF THE UNITED STATES-FRANKLIN DELANO ROOSEVELT, of New York. (Died April 12, 1945.)\nVICE PRESIDENT OF THE UNITED STATES-HARRY S. TRUMAN, of Missouri.\nSECRETARY OF STATE-EDWARD R. STETTINIUS, of Virginia, continued from preceding administration.\nSECRETARY OF THE TREASURY-HENRY MORGENTHAU, JR., of New York, continued from preceding administration.\nSECRETARY OF WAR-HENRY L. STIMSON, of New York, continued from preceding administration.\nATTORNEY GENERAL-FRANCIS BIDDLE, of Pennsylvania, continued from preceding administration.\nPOSTMASTER GENERAL-FRANK C. WALKER, of Pennsylvania, continued from preceding administration. FRANK C. WALKER, of\n\nPennsylvania, recommissioned February 6, 1945.\n\nSECRETARY OF THE NAVY-JAMES V. FORRESTAL, of New York, continued from preceding administration.\nSECRETARY OF THE INTERIOR-HAROLD L. ICKES, of Illinois, continued from preceding administration.\nSECRETARY OF AGRICULTURE-CLAUDE R. WICKARD, of Indiana, continued from preceding administration.\nSECRETARY OF COMMERCE-JESSE H. JONES, of Texas, continued from preceding administration. HENRY A. WALLACE, of Iowa,\n\nMarch 1, 1945; entered upon duties March 2, 1945.\n\nSECRETARY OF LABOR-FRANCES PERKINS, of New York, continued from preceding administration.", "president": "FRANKLIN DELANO ROOSEVELT", "dates": "JANUARY 20, 1945, TO APRIL 12, 1945", "type": "presidential_administration", "description": "Fourth Administration of FRANKLIN DELANO ROOSEVELT"}
{"body": "PRESIDENT OF THE UNITED STATES-HARRY S. TRUMAN, of Missouri.\nPRESIDENT PRO TEMPORE OF THE SENATE-KENNETH MCKELLAR, of Tennessee. ARTHUR S. VANDENBERG, of Michigan, January 4, 1947.\n\nSECRETARY OF STATE-EDWARD R. STETTINIUS, of Virginia, continued from preceding administration. JAMES F. BYRNES, of South\nCarolina, July 2, 1945; entered upon duties July 3, 1945. GEORGE C. MARSHALL, of Pennsylvania, January 8, 1947; entered\nupon duties January 21, 1947.\n\nSECRETARY OF THE TREASURY-HENRY MORGENTHAU, JR., of New York, continued from preceding administration. FRED M.\nVINSON, of Kentucky, July 18, 1945; entered upon duties July 23, 1945. JOHN W. SNYDER, of Missouri, June 12, 1946; entered\nupon duties June 25, 1946.\n\nSECRETARY OF DEFENSE-JAMES V. FORRESTAL, of New York, July 26, 1947; entered upon duties September 17, 1947.\nSECRETARY OF WAR-HENRY L. STIMSON, of New York, continued from preceding administration. ROBERT PORTER PATTERSON,\nof New York, September 26, 1945; entered upon duties September 27, 1945. KENNETH C. ROYALL, of North Carolina, July 21,\n1947; entered upon duties July 25, 1947, and served until September 17, 1947.\n\nATTORNEY GENERAL-FRANCIS BIDDLE, of Pennsylvania, continued from preceding administration. TOM C. CLARK, of Texas, June\n\n15, 1945; entered upon duties July 1, 1945.\n\nPOSTMASTER GENERAL-FRANK C. WALKER, of Pennsylvania, continued from preceding administration. ROBERT E. HANNEGAN,\nof Missouri, May 8, 1945; entered upon duties July 1, 1945. JESSE M. DONALDSON, of Missouri, December 16, 1947.\n\nSECRETARY OF THE NAVY-JAMES V. FORRESTAL, of New York, continued from preceding administration; served until September\n\n17, 1947.\n\nSECRETARY OF THE INTERIOR-HAROLD L. ICKES, of Illinois, continued from preceding administration. JULIUS A. KRUG, of Wisconsin, March 6, 1946; entered upon duties March 18, 1946.\n\nSECRETARY OF AGRICULTURE-CLAUDE R. WICKARD, of Indiana, continued from preceding administration. CLINTON P. ANDERSON, of New Mexico, June 2, 1945; entered upon duties June 30, 1945. CHARLES F. BRANNAN, of Colorado, May 29, 1948; entered upon duties June 2, 1948.\n\nSECRETARY OF COMMERCE-HENRY A. WALLACE, of Iowa, continued from preceding administration. WILLIAM AVERELL HARRIMAN, of New York, ad interim, September 28, 1946, to January 28, 1947. WILLIAM AVERELL HARRIMAN, of New York, January\n28, 1947. CHARLES SAWYER, of Ohio, May 6, 1948.\n\nSECRETARY OF LABOR-FRANCES PERKINS, of New York, continued from preceding administration. LEWIS B. SCHWELLENBACH, of\nWashington, June 1, 1945; entered upon duties July 1, 1945. (Died June 10, 1948.) MAURICE J. TOBIN, of Massachusetts, ad\ninterim, August 13, 1948.", "president": "HARRY S. TRUMAN", "dates": "APRIL 12, 1945, TO JANUARY 20, 1949", "type": "presidential_administration", "description": "First Administration of HARRY S. TRUMAN"}
{"body": "PRESIDENT OF THE UNITED STATES-HARRY S. TRUMAN, of Missouri.\nVICE PRESIDENT OF THE UNITED STATES-ALBEN W. BARKLEY, of Kentucky.\nSECRETARY OF STATE-DEAN G. ACHESON, of Connecticut, January 19, 1949; entered upon duties January 21, 1949.\nSECRETARY OF THE TREASURY-JOHN W. SNYDER, of Missouri, continued from preceding administration.\nSECRETARY OF DEFENSE-JAMES V. FORRESTAL, of New York, continued from preceding administration. LOUIS A. JOHNSON, of\nWest Virginia, March 23, 1949; entered upon duties March 28, 1949. GEORGE C. MARSHALL, of Pennsylvania, September 20,\n1950; entered upon duties September 21, 1950. ROBERT A. LOVETT, of New York, September 14, 1951; entered upon duties\nSeptember 17, 1951.\n\nATTORNEY GENERAL-TOM C. CLARK, of Texas, continued from preceding administration. J. HOWARD MCGRATH, of Rhode Island,\nAugust 19, 1949; entered upon duties August 14, 1949. JAMES. P. MCGRANERY, of Pennsylvania, May 21, 1952; entered upon\nduties May 27, 1952.\n\nPOSTMASTER GENERAL-JESSE M. DONALDSON, of Missouri, continued from preceding administration. JESSE M. DONALDSON, of\n\nMissouri, recommissioned February 8, 1949.\n\nSECRETARY OF THE INTERIOR-JULIUS A. KRUG, of Wisconsin, continued from preceding administration. OSCAR L. CHAPMAN,\nof Colorado (Under Secretary), ad interim, December 1, 1949, to January 19, 1950. OSCAR L. CHAPMAN, of Colorado, January\n19, 1950.\n\nSECRETARY OF AGRICULTURE-CHARLES F. BRANNAN, of Colorado, continued from preceding administration.\nSECRETARY OF COMMERCE-CHARLES SAWYER, of Ohio, continued from preceding administration.\nSECRETARY OF LABOR-MAURICE J. TOBIN, of Massachusetts, ad interim, continued from preceding administration. MAURICE J.\nTOBIN, of Massachusetts, February 1, 1949.", "president": "HARRY S. TRUMAN", "dates": "JANUARY 20, 1949, TO JANUARY 20, 1953", "type": "presidential_administration", "description": "Second Administration of HARRY S. TRUMAN"}
{"body": "PRESIDENT OF THE UNITED STATES-DWIGHT D. EISENHOWER, of New York.\nVICE PRESIDENT OF THE UNITED STATES-RICHARD M. NIXON, of California.\nSECRETARY OF STATE-JOHN FOSTER DULLES, of New York, January 21, 1953.\nSECRETARY OF THE TREASURY-GEORGE M. HUMPHREY, of Ohio, January 21, 1953.\nSECRETARY OF DEFENSE-CHARLES E. WILSON, of Michigan, January 26, 1953; entered upon duties January 28, 1953.\nATTORNEY GENERAL-HERBERT BROWNELL, JR., of New York, January 21, 1953.\nPOSTMASTER GENERAL-ARTHUR E. SUMMERFIELD, of Michigan, January 21, 1953.\nSECRETARY OF THE INTERIOR-DOUGLAS MCKAY, of Oregon, January 21, 1953. FREDERICK A. SEATON, of Nebraska, June 6,\n\n1956; entered upon duties June 8, 1956.\n\nSECRETARY OF AGRICULTURE-EZRA TAFT BENSON, of Utah, January 21, 1953.\nSECRETARY OF COMMERCE-SINCLAIR WEEKS, of Massachusetts, January 21, 1953.\nSECRETARY OF LABOR-MARTIN P. DURKIN, of Maryland, January 21, 1953. JAMES P. MITCHELL, of New Jersey, ad interim,\n\nOctober 9, 1953, to January 19, 1954. JAMES P. MITCHELL, of New Jersey, January 19, 1954.\n\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE-OVETA CULP HOBBY, of Texas, April 10, 1953; entered upon duties\n\nApril 11, 1953. MARION B. FOLSOM, of New York, July 20, 1955; entered upon duties August 1, 1955.", "president": "DWIGHT D. EISENHOWER", "dates": "JANUARY 20, 1953, TO JANUARY 20, 1957", "type": "presidential_administration", "description": "First Administration of DWIGHT D. EISENHOWER"}
{"body": "PRESIDENT OF THE UNITED STATES-DWIGHT D. EISENHOWER, of Pennsylvania.\nVICE PRESIDENT OF THE UNITED STATES-RICHARD M. NIXON, of California.\nSECRETARY OF STATE-JOHN FOSTER DULLES, of New York, continued from preceding administration. CHRISTIAN A. HERTER, of\n\nMassachusetts, April 21, 1959; entered upon duties April 22, 1959.\n\nSECRETARY OF THE TREASURY-GEORGE M. HUMPHREY, of Ohio, continued from preceding administration. ROBERT BERNERD\nANDERSON, of Connecticut, July 2, 1957; entered upon duties July 29, 1957.\n\nSECRETARY OF DEFENSE-CHARLES E. WILSON, of Michigan, continued from preceding administration. NEIL H. MCELROY, of\nOhio, August 19, 1957; entered upon duties October 9, 1957. THOMAS S. GATES, JR., of Pennsylvania, ad interim, December\n1, 1959, to January 26, 1960. THOMAS S. GATES, JR., of Pennsylvania, January 26, 1960.\n\nATTORNEY GENERAL-HERBERT BROWNELL, JR., of New York, continued from preceding administration. WILLIAM P. ROGERS, of\n\nMaryland, ad interim, November 8, 1957, to January 27, 1958. WILLIAM P. ROGERS, of Maryland, January 27, 1958.\n\nPOSTMASTER GENERAL-ARTHUR E. SUMMERFIELD, of Michigan, continued from preceding administration. ARTHUR E. SUMMERFIELD, of Michigan, recommissioned February 4, 1957.\n\nSECRETARY OF THE INTERIOR-FREDERICK A. SEATON, of Nebraska, continued from preceding administration.\nSECRETARY OF AGRICULTURE-EZRA TAFT BENSON, of Utah, continued from preceding administration.\nSECRETARY OF COMMERCE-SINCLAIR WEEKS, of Massachusetts, continued from preceding administration. LEWIS L. STRAUSS, of\nNew York, ad interim, November 13, 1958, to June 27, 1959. FREDERICK H. MUELLER, of Michigan (Under Secretary), ad interim, July 21, 1959, to August 6, 1959. FREDERICK H. MUELLER, of Michigan, August 6, 1959.\n\nSECRETARY OF LABOR-JAMES P. MITCHELL, of New Jersey, continued from preceding administration.\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE-MARION B. FOLSOM, of New York, continued from preceding administration. ARTHUR S. FLEMMING, of Ohio, July 9, 1958; entered upon duties August 1, 1958.", "president": "DWIGHT D. EISENHOWER", "dates": "JANUARY 20, 1957, TO JANUARY 20, 1961", "type": "presidential_administration", "description": "Second Administration of DWIGHT D. EISENHOWER"}
{"body": "PRESIDENT OF THE UNITED STATES-JOHN F. KENNEDY, of Massachusetts. (Died November 22, 1963.)\nVICE PRESIDENT OF THE UNITED STATES-LYNDON B. JOHNSON, of Texas.\nSECRETARY OF STATE-DEAN RUSK, of New York, January 21, 1961.\nSECRETARY OF THE TREASURY-DOUGLAS DILLON, of New Jersey, January 21, 1961.\nSECRETARY OF DEFENSE-ROBERT S. MCNAMARA, of Michigan, January 21, 1961.\nATTORNEY GENERAL-ROBERT F. KENNEDY, of Massachusetts, January 21, 1961.\nPOSTMASTER GENERAL-J. EDWARD DAY, of California, January 21, 1961. JOHN A. GRONOUSKI, of Wisconsin, September 24,\n\n1963; entered upon duties September 30, 1963.\n\nSECRETARY OF THE INTERIOR-STEWART L. UDALL, of Arizona, January 21, 1961.\nSECRETARY OF AGRICULTURE-ORVILLE L. FREEMAN, of Minnesota, January 21, 1961.\nSECRETARY OF COMMERCE-LUTHER H. HODGES, of North Carolina, January 21, 1961.\nSECRETARY OF LABOR-ARTHUR J. GOLDBERG, of Illinois, January 21, 1961. W. WILLARD WIRTZ, of Illinois, September 20, 1962;\n\nentered upon duties September 25, 1962.\n\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE-ABRAHAM A. RIBICOFF, of Connecticut, January 21, 1961. ANTHONY J.\nCELEBREZZE, of Ohio, July 20, 1962; entered upon duties July 31, 1962.", "president": "JOHN F. KENNEDY", "dates": "JANUARY 20, 1961, TO NOVEMBER 22, 1963", "type": "presidential_administration", "description": "Administration of JOHN F. KENNEDY"}
{"body": "PRESIDENT OF THE UNITED STATES-LYNDON B. JOHNSON, of Texas.\nPRESIDENT PRO TEMPORE OF THE SENATE-CARL T. HAYDEN, of Arizona.\nSECRETARY OF STATE-DEAN RUSK, of New York, continued from preceding administration.\nSECRETARY OF THE TREASURY-DOUGLAS DILLON, of New Jersey, continued from preceding administration.\nSECRETARY OF DEFENSE-ROBERT S. MCNAMARA, of Michigan, continued from preceding administration.\nATTORNEY GENERAL-ROBERT F. KENNEDY, of Massachusetts, continued from preceding administration. NICHOLAS D. KATZENBACH, of Illinois (Deputy Attorney General), ad interim, September 4, 1964.\n\nPOSTMASTER GENERAL-JOHN A. GRONOUSKI, of Wisconsin, continued from preceding administration.\nSECRETARY OF THE INTERIOR-STEWART L. UDALL, of Arizona, continued from preceding administration.\nSECRETARY OF AGRICULTURE-ORVILLE L. FREEMAN, of Minnesota, continued from preceding administration.\nSECRETARY OF COMMERCE-LUTHER H. HODGES, of North Carolina, continued from preceding administration. JOHN T. O’CONNOR, of New Jersey, January 15, 1965; entered upon duties January 18, 1965.\n\nSECRETARY OF LABOR-W. WILLARD WIRTZ, of Illinois, continued from preceding administration.\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE-ANTHONY J. CELEBREZZE, of Ohio, continued from preceding administration.", "president": "LYNDON B. JOHNSON", "dates": "NOVEMBER 22, 1963, TO JANUARY 20, 1965", "type": "presidential_administration", "description": "First Administration of LYNDON B. JOHNSON"}
{"body": "PRESIDENT OF THE UNITED STATES-LYNDON B. JOHNSON, of Texas.\nVICE PRESIDENT OF THE UNITED STATES-HUBERT H. HUMPHREY, of Minnesota.\nSECRETARY OF STATE-DEAN RUSK, of New York, continued from preceding administration.\nSECRETARY OF THE TREASURY-DOUGLAS DILLON, of New Jersey, continued from preceding administration. HARRY H. FOWLER,\nof Virginia, March 25, 1965; entered upon duties April 1, 1965. JOSEPH W. BARR, of Indiana, entered upon duties December\n21, 1968 (recess appointment); confirmed January 9, 1969.\n\nSECRETARY OF DEFENSE-ROBERT S. MCNAMARA, of Michigan, continued from preceding administration. CLARK M. CLIFFORD,\nof Maryland, January 30, 1968; entered upon duties March 1, 1968.\n\nATTORNEY GENERAL-NICHOLAS D. KATZENBACH, of Illinois (Deputy Attorney General), ad interim, continued from preceding administration. NICHOLAS D. KATZENBACH, of Illinois, confirmed February 10, 1965; entered upon duties February 11, 1965.\nRAMSEY CLARK, of Texas, March 2, 1967.\n\nPOSTMASTER GENERAL-JOHN A. GRONOUSKI, of Wisconsin, continued from preceding administration. JOHN A. GRONOUSKI, of\nWisconsin, recommissioned February 17, 1965. LAWRENCE F. O’BRIEN, of Massachusetts, September 1, 1965; entered upon duties\nNovember 3, 1965. W. MARVIN WATSON, of Texas, April 23, 1968; entered upon duties April 26, 1968.\n\nSECRETARY OF THE INTERIOR-STEWART L. UDALL, of Arizona, continued from preceding administration.\nSECRETARY OF AGRICULTURE-ORVILLE L. FREEMAN, of Minnesota, continued from preceding administration.\nSECRETARY OF COMMERCE-JOHN T. O’CONNOR, of New Jersey, continued from preceding administration. ALEXANDER B. TROWBRIDGE, of New York, ad interim, February 1, 1967. ALEXANDER B. TROWBRIDGE, of New York, June 8, 1967; entered upon\nduties June 14, 1967. CYRUS R. SMITH, of New York, March 1, 1968; entered upon duties March 6, 1968.\n\nSECRETARY OF LABOR-W. WILLARD WIRTZ, of Illinois, continued from preceding administration.\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE-ANTHONY J. CELEBREZZE, of Ohio, continued from preceding administration. JOHN W. GARDNER, of New York, August 11, 1965; entered upon duties August 18, 1965. WILBUR J. COHEN, of Michigan, ad interim, March 2, 1968. WILBUR J. COHEN, of Michigan, May 16, 1968.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-ROBERT C. WEAVER, of New York, January 17, 1966; entered upon\n\nduties January 18, 1966. ROBERT C. WOOD, of Florida, ad interim, January 2, 1969.\n\nSECRETARY OF TRANSPORTATION-ALAN S. BOYD, of Florida, January 12, 1967; entered upon duties January 16, 1967.", "president": "LYNDON B. JOHNSON", "dates": "JANUARY 20, 1965, TO JANUARY 20, 1969", "type": "presidential_administration", "description": "Second Administration of LYNDON B. JOHNSON"}
{"body": "PRESIDENT OF THE UNITED STATES-RICHARD M. NIXON, of California.\nVICE PRESIDENT OF THE UNITED STATES-SPIRO T. AGNEW, of Maryland.\nSECRETARY OF STATE-WILLIAM P. ROGERS, of Maryland, January 20, 1969; entered upon duties January 22, 1969.\nSECRETARY OF THE TREASURY-DAVID M. KENNEDY, of Illinois, January 20, 1969; entered upon duties January 21, 1969. JOHN\nB. CONNALLY, of Texas; entered upon duties February 11, 1971. GEORGE P. SHULTZ, of Illinois, June 8, 1972; entered upon\nduties June 12, 1972.\n\nSECRETARY OF DEFENSE-MELVIN R. LAIRD, of Wisconsin, January 20, 1969; entered upon duties January 21, 1969.\nATTORNEY GENERAL-JOHN N. MITCHELL, of New York, January 20, 1969; entered upon duties January 21, 1969. RICHARD G.\nKLEINDIENST, of Arizona (Deputy Attorney General), ad interim, March 1, 1972. RICHARD G. KLEINDIENST, of Arizona, June 8,\n1972; entered upon duties June 12, 1972.\n\nPOSTMASTER GENERAL-WINTON M. BLOUNT, of Alabama, January 20, 1969; entered upon duties January 21, 1969.\nSECRETARY OF THE INTERIOR-WALTER J. HICKEL, of Alaska, January 23, 1969; entered upon duties January 24, 1969. FRED\nJ. RUSSELL, of California, ad interim, November 26, 1970. ROGERS C. B. MORTON, of Maryland; entered upon duties January\n29, 1971.\n\nSECRETARY OF AGRICULTURE-CLIFFORD M. HARDIN, of Nebraska, January 20, 1969; entered upon duties January 21, 1969.\n\nEARL L. BUTZ, of Indiana, December 2, 1971; entered upon duties December 2, 1971.\n\nSECRETARY OF COMMERCE-MAURICE H. STANS, of New York, January 20, 1969; entered upon duties January 21, 1969. PETER\nG. PETERSON, of Illinois, February 21, 1972; entered upon duties February 29, 1972.\n\nSECRETARY OF LABOR-GEORGE P. SCHULTZ, of Illinois, January 20, 1969; entered upon duties January 21, 1969. JAMES D.\nHODGSON, of California, June 17, 1970; entered upon duties July 2, 1970.\n\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE-ROBERT H. FINCH, of California, January 21, 1969. ELLIOT L. RICHARDSON, of Massachusetts, June 15, 1970; entered upon duties June 24, 1970.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-GEORGE ROMNEY, of Michigan, January 20, 1969; entered upon duties\n\nJanuary 21, 1969.\n\nSECRETARY OF TRANSPORTATION-JOHN A. VOLPE, of Massachusetts, January 20, 1969; entered upon duties January 21, 1969.", "president": "RICHARD M. NIXON", "dates": "JANUARY 20, 1969, TO JANUARY 20, 1973", "type": "presidential_administration", "description": "First Administration of RICHARD M. NIXON"}
{"body": "PRESIDENT OF THE UNITED STATES-RICHARD M. NIXON, of California. (Resigned August 9, 1974.)\nVICE PRESIDENT OF THE UNITED STATES-SPIRO T. AGNEW, of Maryland. (Resigned October 10, 1973.) GERALD R. FORD, JR.,\nof Michigan, December 6, 1973. (First Vice President to be nominated by the President and confirmed by the Congress, pursuant to the Twenty-fifth Amendment to the Constitution of the United States.)\n\nSECRETARY OF STATE-WILLIAM P. ROGERS, of Maryland, continued from preceding administration. KENNETH RUSH, of New York\n(Deputy Secretary), ad interim, September 4, 1973. HENRY A. KISSINGER, of the District of Columbia, September 21, 1973; entered upon duties September 21, 1973.\n\nSECRETARY OF THE TREASURY-GEORGE P. SHULTZ, of Illinois, continued from preceding administration. WILLIAM E. SIMON,\nof New Jersey; entered upon duties May 7, 1974.\n\nSECRETARY OF DEFENSE-MELVIN R. LAIRD, of Wisconsin, continued from preceding administration. ELLIOT L. RICHARDSON, of\nMassachusetts, January 29, 1973; entered upon duties February 2, 1973. WILLIAM P. CLEMENTS, JR., of Texas, ad interim, May\n26, 1973. JAMES R. SCHLESINGER, of Virginia, June 28, 1973; entered upon duties June 29, 1973.\n\nATTORNEY GENERAL-RICHARD G. KLEINDIENST, of Arizona, continued from preceding administration. ELLIOT L. RICHARDSON, of\nMassachusetts, May 23, 1973; entered upon duties May 24, 1973. ROBERT H. BORK, of Pennsylvania (Solicitor General), ad interim, October 20, 1973. WILLIAM B. SAXBE, of Ohio, December 17, 1973; entered upon duties January 4, 1974.\nSECRETARY OF THE INTERIOR-ROGERS C. B. MORTON, of Maryland, continued from preceding administration.\nSECRETARY OF AGRICULTURE-EARL L. BUTZ, of Indiana, continued from preceding administration.\nSECRETARY OF COMMERCE-PETER G. PETERSON, of Illinois, continued from preceding administration. FREDERICK B. DENT, of\n\nSouth Carolina, January 18, 1973; entered upon duties February 2, 1973.\n\nSECRETARY OF LABOR-JAMES D. HODGSON, of California, continued from preceding administration. PETER J. BRENNAN, of New\n\nYork, January 31, 1973; entered upon duties February 2, 1973.\n\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE-ELLIOT L. RICHARDSON, of Massachusetts, continued from preceding administration. CASPAR W. WEINBERGER, of California, February 8, 1973; entered upon duties February 8, 1973.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-GEORGE ROMNEY, of Michigan, continued from preceding administration. JAMES T. LYNN, of Ohio, January 21, 1973; entered upon duties February 2, 1973.\n\nSECRETARY OF TRANSPORTATION-JOHN A. VOLPE, of Massachusetts, continued from preceding administration. CLAUDE S.\nBRINEGAR, of California, January 18, 1973; entered upon duties February 2, 1973.", "president": "RICHARD M. NIXON", "dates": "JANUARY 20, 1973, TO AUGUST 9, 1974", "type": "presidential_administration", "description": "Second Administration of RICHARD M. NIXON"}
{"body": "PRESIDENT OF THE UNITED STATES-GERALD R. FORD, JR., of Michigan, December 6, 1973.\nVICE PRESIDENT OF THE UNITED STATES-NELSON A. ROCKEFELLER, of New York, December 19, 1974. (Nominated by the\n\nPresident and confirmed by the Congress, pursuant to the Twenty-fifth Amendment to the Constitution.)\n\nSECRETARY OF STATE-HENRY A. KISSINGER, of the District of Columbia, continued from preceding administration.\nSECRETARY OF THE TREASURY-WILLIAM E. SIMON, of New Jersey, continued from preceding administration.\nSECRETARY OF DEFENSE-JAMES R. SCHLESINGER, of Virginia, continued from preceding administration. DONALD H. RUMSFELD,\nof Illinois, November 18, 1975; entered upon duties November 18, 1975.\n\nATTORNEY GENERAL-WILLIAM B. SAXBE, of Ohio, continued from preceding administration. EDWARD HIRSCH LEVI, of Illinois,\n\nFebruary 5, 1975; entered upon duties February 6, 1975.\n\nSECRETARY OF THE INTERIOR-ROGERS C. B. MORTON, of Maryland, continued from preceding administration. D. KENT\nFRIZZELL, of Kansas (Solicitor), ad interim, May 1, 1975. STANLEY K. HATHAWAY, of Wyoming, June 11, 1975; entered upon\nduties June 12, 1975. D. KENT FRIZZELL, of Kansas (Solicitor), ad interim, July 25, 1975. THOMAS SAVIG KLEPPE, of North\nDakota, October 9, 1975; entered upon duties October 13, 1975.\n\nSECRETARY OF AGRICULTURE-EARL L. BUTZ, of Indiana, continued from preceding administration. JOHN A. KNEBEL, of Oklahoma (Under Secretary), ad interim, October 5, 1976. JOHN A. KNEBEL, of Oklahoma (recess appointment); entered upon duties\nNovember 3, 1976.\n\nSECRETARY OF COMMERCE-FREDERICK B. DENT, of South Carolina, continued from preceding administration. JOHN K. TABOR,\nof Pennsylvania (Under Secretary), ad interim, March 12, 1975. ROGERS C. B. MORTON, of Maryland, April 25, 1975; entered\nupon duties May 1, 1975. ELLIOT L. RICHARDSON, of Massachusetts, December 11, 1975; entered upon duties February 1, 1976.\nSECRETARY OF LABOR-PETER J. BRENNAN, of New York, continued from preceding administration. JOHN T. DUNLOP, of Massachusetts, March 6, 1975; entered upon duties March 18, 1975. WILLIE J. USERY, JR., of Georgia, February 4, 1976; entered\nupon duties February 10, 1976.\n\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE-CASPAR W. WEINBERGER, of California, continued from preceding administration. FORREST DAVID MATHEWS, of Alabama, June 26, 1975; entered upon duties August 8, 1975.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-JAMES T. LYNN, of Ohio, continued from preceding administration.\n\nCARLA A. HILLS, of California, March 5, 1975; entered upon duties March 10, 1975.\n\nSECRETARY OF TRANSPORTATION-CLAUDE S. BRINEGAR, of California, continued from preceding administration. WILLIAM T.\nCOLEMAN, JR., of Pennsylvania, March 3, 1975; entered upon duties March 4, 1975.\n\nAdministration of JAMES EARL (JIMMY) CARTER, JR.\n\nJANUARY 20, 1977, TO JANUARY 20, 1981\nPRESIDENT OF THE UNITED STATES-JAMES EARL (JIMMY) CARTER, JR., of Georgia.\nVICE PRESIDENT OF THE UNITED STATES-WALTER F. MONDALE, of Minnesota.\nSECRETARY OF STATE-CYRUS R. VANCE, of New York, January 20, 1977; entered upon duties January 21, 1977. WARREN M.\nCHRISTOPHER, of California (Deputy Secretary), ad interim, April 28, 1980. EDMUND S. MUSKIE, of Maine, May 7, 1980; entered\nupon duties May 8, 1980.\n\nSECRETARY OF THE TREASURY-W. MICHAEL BLUMENTHAL, of Michigan, January 20, 1977; entered upon duties January 21,\n\n1977. G. WILLIAM MILLER, of California, August 2, 1979; entered upon duties August 6, 1979.\n\nSECRETARY OF DEFENSE-HAROLD BROWN, of California, January 20, 1977; entered upon duties January 21, 1977.\nATTORNEY GENERAL-GRIFFIN B. BELL, of Georgia, January 25, 1977; entered upon duties January 26, 1977. BENJAMIN R. CIVILETTI, of Maryland, August 1, 1979; entered upon duties August 16, 1979.\n\nSECRETARY OF THE INTERIOR-CECIL D. ANDRUS, of Idaho, January 20, 1977; entered upon duties January 21, 1977.\nSECRETARY OF AGRICULTURE-ROBERT SELMER BERGLAND, of Minnesota, January 20, 1977; entered upon duties January 21,\n\n1977.\nSECRETARY OF COMMERCE-JUANITA M. KREPS, of North Carolina, January 20, 1977; entered upon duties January 21, 1977.\nLUTHER H. HODGES, JR., of North Carolina (Under Secretary), ad interim, November 5, 1979. PHILIP M. KLUTZNICK, of Illinois,\nDecember 20, 1979; entered upon duties December 21, 1979.\n\nSECRETARY OF LABOR-F. RAY MARSHALL, of Texas, January 26, 1977; entered upon duties January 26, 1977.\nSECRETARY OF HEALTH, EDUCATION, AND WELFARE (Renamed Health and Human Services, under the Department of Education Organization Act [Public Law 96–88], approved October 17, 1979; effective May 4, 1980.)-JOSEPH A. CALIFANO, JR., of\nthe District of Columbia, January 24, 1977; entered upon duties January 25, 1977. PATRICIA ROBERTS HARRIS, of the District\nof Columbia, July 27, 1979; entered upon duties August 3, 1979.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-PATRICIA ROBERTS HARRIS, of the District of Columbia, January 20,\n1977; entered upon duties January 21, 1977. JAY JANIS, of Florida (Under Secretary), ad interim, August 3, 1979. MOON\nLANDRIEU, of Louisiana, September 12, 1979; entered upon duties September 14, 1979.\n\nSECRETARY OF TRANSPORTATION-BROCKMAN ADAMS, of Washington, January 21, 1977; entered upon duties January 21, 1977.\nW. GRAHAM CLAYTOR, JR., of the District of Columbia, ad interim, July 24, 1979. NEIL E. GOLDSCHMIDT, of Oregon; entered\nupon duties August 10, 1979 (recess appointment); confirmed September 21, 1979.\n\nSECRETARY OF ENERGY-JAMES R. SCHLESINGER, of Virginia, August 4, 1977; entered upon duties August 5, 1977. CHARLES\nW. DUNCAN, JR., of Texas, July 31, 1979; entered upon duties August 24, 1979.\n\nSECRETARY OF EDUCATION-SHIRLEY M. HUFSTEDLER, of California, November 30, 1979; entered upon duties December 6, 1979.", "president": "GERALD R. FORD, JR.", "dates": "AUGUST 9, 1974, TO JANUARY 20, 1977", "type": "presidential_administration", "description": "Administration of GERALD R. FORD, JR."}
{"body": "PRESIDENT OF THE UNITED STATES-RONALD W. REAGAN, of California.\nVICE PRESIDENT OF THE UNITED STATES-GEORGE HERBERT WALKER BUSH, of Texas.\nSECRETARY OF STATE-ALEXANDER MEIGS HAIG, JR., of Connecticut, January 21, 1981; entered upon duties January 22, 1981.\nWALTER J. STOESSEL, JR., of the District of Columbia (Deputy Secretary), ad interim, July 5, 1982. GEORGE P. SHULTZ, of California, July 15, 1982; entered upon duties July 16, 1982.\n\nSECRETARY OF THE TREASURY-DONALD T. REGAN, of New Jersey, January 21, 1981; entered upon duties January 22, 1981.\nSECRETARY OF DEFENSE-CASPAR W. WEINBERGER, of California, January 20, 1981; entered upon duties January 20, 1981.\nATTORNEY GENERAL-WILLIAM FRENCH SMITH, of California, January 22, 1981; entered upon duties January 23, 1981.\nSECRETARY OF THE INTERIOR-JAMES G. WATT, of Colorado, January 22, 1981; entered upon duties January 23, 1981. J. J.\nSIMPSON III, of New Jersey (Under Secretary), ad interim, November 8, 1983. WILLIAM P. CLARK, of California, November 18,\n1983; entered upon duties November 18, 1983.\n\nSECRETARY OF AGRICULTURE-JOHN R. BLOCK, of Illinois, January 22, 1981; entered upon duties January 23, 1981.\nSECRETARY OF COMMERCE-MALCOLM BALDRIDGE, of Connecticut, January 23, 1981; entered upon duties January 23, 1981.\nSECRETARY OF LABOR-RAYMOND J. DONOVAN, of New Jersey, February 3, 1981; entered upon duties February 4, 1981. (October\n\n1, 1984, Secretary Donovan took a leave of absence, which continued into the second administration of Ronald Reagan.)\n\nSECRETARY OF HEALTH AND HUMAN SERVICES-RICHARD S. SCHWEIKER, of Pennsylvania, January 21, 1981; entered upon\nduties January 22, 1981. THOMAS R. DONNELLY, of Virginia (Assistant Secretary for Legislation), ad interim, February 4, 1983.\nMARGARET M. HECKLER, of Massachusetts, March 3, 1983; entered upon duties March 9, 1983.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-SAMUEL R. PIERCE, JR., of New York, January 22, 1981; entered upon\n\nduties January 23, 1981.\n\nSECRETARY OF TRANSPORTATION-ANDREW L. LEWIS, JR., of Pennsylvania, January 22, 1981; entered upon duties January 23,\n1981. DARRELL M. TRENT, of Kansas (Deputy Secretary), ad interim, February 1, 1983. ELIZABETH HANFORD DOLE, of Kansas,\nFebruary 1, 1983; entered upon duties, February 7, 1983.\n\nSECRETARY OF ENERGY-JAMES B. EDWARDS, of South Carolina, January 22, 1981; entered upon duties January 23, 1981. DONALD P. HODEL, of Oregon; entered upon duties November 5, 1982 (recess appointment); confirmed December 8, 1982.\n\nSECRETARY OF EDUCATION-TERRELL H. BELL, of Utah, January 22, 1981; entered upon duties January 23, 1981. GARY L.\nJONES, of Michigan (Under Secretary), ad interim, December 31, 1984.", "president": "RONALD W. REAGAN", "dates": "JANUARY 20, 1981, TO JANUARY 20, 1985", "type": "presidential_administration", "description": "First Administration of RONALD W. REAGAN"}
{"body": "PRESIDENT OF THE UNITED STATES-RONALD W. REAGAN, of California.\nVICE PRESIDENT OF THE UNITED STATES-GEORGE HERBERT WALKER BUSH, of Texas.\nSECRETARY OF STATE-GEORGE P. SHULTZ, of California, continued from preceding administration.\nSECRETARY OF THE TREASURY-JAMES A. BAKER III, of Texas, January 29, 1985; entered upon duties February 3, 1985. NICHOLAS F. BRADY, of New Jersey, September 14, 1988; entered upon duties September 15, 1988.\n\nSECRETARY OF DEFENSE-CASPAR W. WEINBERGER, of California, continued from preceding administration. FRANK C. CARLUCCI,\nof Virginia, November 20, 1987; entered upon duties November 23, 1987.\n\nATTORNEY GENERAL-EDWIN MEESE III, of California, February 23, 1985; entered upon duties February 23, 1985. RICHARD L.\nTHORNBURGH, of Pennsylvania, August 11, 1988; entered upon duties August 12, 1988.\n\nSECRETARY OF THE INTERIOR-DONALD P. HODEL, of Virginia, February 6, 1985; entered upon duties February 7, 1985.\nSECRETARY OF AGRICULTURE-JOHN R. BLOCK, of Illinois, continued from preceding administration. RICHARD E. LYNG, of California, March 6, 1986; entered upon duties March 7, 1986.\n\nSECRETARY OF COMMERCE-MALCOLM BALDRIDGE, of Connecticut, continued from preceding administration. CLARENCE J.\nBROWN, JR., of Ohio (Deputy Secretary), ad interim, July 25, 1987. C. WILLIAM VERITY, JR., of Ohio, October 13, 1987; entered\nupon duties October 15, 1987.\n\nSECRETARY OF LABOR-RAYMOND J. DONOVAN, of New Jersey, continued from preceding administration. (Secretary Donovan remained on leave of absence until his resignation March 15, 1985.) WILLIAM EMERSON BROCK III, of Tennessee, April 26, 1985;\nentered upon duties April 29, 1985. DENNIS E. WHITFIELD, of Georgia (Deputy Secretary), ad interim, October 31, 1987. ANN\nDORE MCLAUGHLIN, of the District of Columbia, December 11, 1987; entered upon duties December 14, 1987.\n\nSECRETARY OF HEALTH AND HUMAN SERVICES-MARGARET M. HECKLER, of Massachusetts, continued from preceding administration. OTIS R. BOWEN, of Indiana, December 12, 1985; entered upon duties December 13, 1985.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-SAMUEL R. PIERCE, JR., of New York, continued from preceding administration.\nSECRETARY OF TRANSPORTATION-ELIZABETH HANFORD DOLE, of Kansas, continued from preceding administration. JAMES H.\nBURNLEY IV, of North Carolina (Deputy Secretary), ad interim, October 1, 1987. JAMES H. BURNLEY IV, of North Carolina,\nNovember 30, 1987; entered upon duties December 2, 1987.\n\nSECRETARY OF ENERGY-JOHN S. HERRINGTON, of California, February 6, 1985; entered upon duties February 7, 1985.\nSECRETARY OF EDUCATION-WILLIAM J. BENNETT, of North Carolina, February 6, 1985; entered upon duties February 6, 1985.\n\nLAURO F. CAVAZOS, of Texas, September 20, 1988; entered upon duties September 20, 1988.", "president": "RONALD W. REAGAN", "dates": "JANUARY 20, 1985, TO JANUARY 20, 1989", "type": "presidential_administration", "description": "Second Administration of RONALD W. REAGAN"}
{"body": "PRESIDENT OF THE UNITED STATES-GEORGE HERBERT WALKER BUSH, of Texas.\nVICE PRESIDENT OF THE UNITED STATES-J. DANFORTH QUAYLE, of Indiana.\nSECRETARY OF STATE-JAMES A. BAKER III, of Texas, January 25, 1989. LAWRENCE S. EAGLEBURGER, of Wisconsin, ad interim,\n\nAugust 23, 1992. LAWRENCE S. EAGLEBURGER, of Wisconsin (recess appointment); entered upon duties December 8, 1992.\n\nSECRETARY OF THE TREASURY-NICHOLAS F. BRADY, of New Jersey, continued from preceding administration.\nSECRETARY OF DEFENSE-RICHARD B. CHENEY, of Wyoming, March 10, 1989; entered upon duties March 17, 1989.\nATTORNEY GENERAL-RICHARD L. THORNBURGH, of Pennsylvania, continued from preceding administration. WILLIAM P. BARR, of\nNew York (Deputy Attorney General), ad interim, August 15, 1991. WILLIAM P. BARR, of New York, November 20, 1991; entered upon duties November 21, 1991.\n\nSECRETARY OF THE INTERIOR-MANUEL LUJAN, JR., of New Mexico, February 3, 1989.\nSECRETARY OF AGRICULTURE-CLAYTON K. YEUTTER, of Nebraska, February 8, 1989; entered upon duties February 16, 1989.\n\nEDWARD MADIGAN, of Illinois, March 7, 1991; entered upon duties March 12, 1991.\n\nSECRETARY OF COMMERCE-ROBERT A. MOSBACHER, of Texas, January 31, 1989; entered upon duties January 31, 1989. ROCKWELL A. SCHNABEL, of California (Deputy Secretary), ad interim, January 16, 1992. BARBARA H. FRANKLIN, of Pennsylvania,\nFebruary 27, 1992; entered upon duties February 27, 1992.\n\nSECRETARY OF LABOR-ELIZABETH HANFORD DOLE, of Kansas, January 25, 1989; entered upon duties January 25, 1989. RODERICK A. DEARMENT, of Virginia (Deputy Secretary), ad interim, November 24, 1990. LYNNE M. MARTIN, of Illinois, February\n7, 1991; entered upon duties February 7, 1991.\n\nSECRETARY OF HEALTH AND HUMAN SERVICES-LOUIS W. SULLIVAN, of Georgia, March 1, 1989; entered upon duties March\n\n1, 1989.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-JACK K. KEMP, of New York, February 2, 1989; entered upon duties\n\nFebruary 13, 1989.\n\nSECRETARY OF TRANSPORTATION-SAMUEL K. SKINNER, of Illinois, January 31, 1989; entered upon duties February 6, 1989.\nJAMES B. BUSEY IV, of Illinois (Deputy Secretary), ad interim, December 14, 1991. ANDREW H. CARD, of Massachusetts, February 21, 1992; entered upon duties February 24, 1992.\n\nSECRETARY OF ENERGY-JAMES D. WATKINS, of California, March 1, 1989; entered upon duties March 1, 1989.\nSECRETARY OF EDUCATION-LAURO F. CAVAZOS, of Texas, continued from preceding administration. LAMAR ALEXANDER, of Tennessee, March 14, 1991; entered upon duties, March 22, 1991.\n\nSECRETARY OF VETERANS’ AFFAIRS-EDWARD J. DERWINSKI, of Illinois, March 2, 1989; entered upon duties March 2, 1989.\n\nANTHONY J. PRINCIPI, of California (Deputy Secretary), ad interim, September 26, 1992.", "president": "GEORGE HERBERT WALKER BUSH", "dates": "JANUARY 20, 1989, TO JANUARY 20, 1993", "type": "presidential_administration", "description": "Administration of GEORGE HERBERT WALKER BUSH"}
{"body": "PRESIDENT OF THE UNITED STATES-WILLIAM JEFFERSON CLINTON, of Arkansas.\nVICE PRESIDENT OF THE UNITED STATES-ALBERT A. GORE, JR., of Tennessee.\nSECRETARY OF STATE-WARREN CHRISTOPHER, of California, January 20, 1993; entered upon duties January 20, 1993.\nSECRETARY OF THE TREASURY-LLOYD BENTSEN, of Texas, January 20, 1993; entered upon duties January 20, 1993. FRANK\nN. NEWMAN, of Massachusetts (Deputy Secretary), ad interim, December 23, 1994. ROBERT RUBIN, of New York, January 10,\n1995; entered upon duties January 10, 1995.\n\nSECRETARY OF DEFENSE-LES ASPIN, of Wisconsin, January 20, 1993; entered upon duties January 20, 1993. WILLIAM J. PERRY,\nof Pennsylvania, February 3, 1994; entered upon duties February 3, 1994.\n\nATTORNEY GENERAL-JANET RENO, of Florida, March 11, 1993; entered upon duties March 12, 1993.\nSECRETARY OF THE INTERIOR-BRUCE BABBITT, of Arizona, January 21, 1993; entered upon duties January 22, 1993.\nSECRETARY OF AGRICULTURE-MIKE ESPY, of Mississippi, January 21, 1993; entered upon duties January 22, 1993. EUGENE\nMOOS, of Washington (Under Secretary), ad interim, January 1, 1995. DANIEL R. GLICKMAN, of Kansas, March 30, 1995; entered\nupon duties March 30, 1995.\n\nSECRETARY OF COMMERCE-RONALD H. BROWN, of New York, January 22, 1993. (Died April 4, 1996.) MARY L. GOOD, of Arkansas (Under Secretary), ad interim, April 4, 1996. MICKEY KANTOR, of Tennessee; entered upon duties April 12, 1996 (recess\nappointment).\nSECRETARY OF LABOR-ROBERT B. REICH, of Massachusetts, January 21, 1993; entered upon duties January 22, 1993.\nSECRETARY OF HEALTH AND HUMAN SERVICES-DONNA E. SHALALA, of Wisconsin, January 21, 1993; entered upon duties\n\nJanuary 22, 1993.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-HENRY G. CISNEROS, of Texas, January 21, 1993; entered upon duties\n\nJanuary 22, 1993.\n\nSECRETARY OF TRANSPORTATION-FEDERICO F. PEN˜ A, of Colorado, January 21, 1993; entered upon duties January 21, 1993.\nSECRETARY OF ENERGY-HAZEL R. O’LEARY, of Minnesota, January 21, 1993; entered upon duties January 22, 1993.\nSECRETARY OF EDUCATION-RICHARD W. RILEY, of South Carolina, January 21, 1993; entered upon duties January 22, 1993.\nSECRETARY OF VETERANS’ AFFAIRS-JESSE BROWN, of Illinois, January 21, 1993; entered upon duties January 22, 1993.", "president": "WILLIAM JEFFERSON CLINTON", "dates": "JANUARY 20, 1993, TO JANUARY 20, 1997", "type": "presidential_administration", "description": "First Administration of WILLIAM JEFFERSON CLINTON"}
{"body": "PRESIDENT OF THE UNITED STATES-WILLIAM JEFFERSON CLINTON, of Arkansas.\nVICE PRESIDENT OF THE UNITED STATES-ALBERT A. GORE, JR., of Tennessee.\nSECRETARY OF STATE-MADELEINE K. ALBRIGHT, of the District of Columbia, January 22, 1997; entered upon duties January\n\n23, 1997.\n\nSECRETARY OF THE TREASURY-ROBERT E. RUBIN, of New York, continued from preceding administration. LAWRENCE H. SUMMERS, of Maryland, July 1, 1999; entered upon duties July 2, 1999.\n\nSECRETARY OF DEFENSE-WILLIAM S. COHEN, of Maine, January 22, 1997; entered upon duties January 24, 1997.\nATTORNEY GENERAL-JANET RENO, of Florida, continued from preceding administration.\nSECRETARY OF THE INTERIOR-BRUCE BABBITT, of Arizona, continued from preceding administration.\nSECRETARY OF AGRICULTURE-DANIEL R. GLICKMAN, of Kansas, continued from preceding administration.\nSECRETARY OF COMMERCE-WILLIAM M. DALEY, of Illinois, January 30, 1997; entered upon duties January 30, 1997. NORMAN\nY. MINETA, of California, July 20, 2000; entered upon duties July 21, 2000.\n\nSECRETARY OF LABOR-CYNTHIA A. METZLER, of the District of Columbia (Deputy Secretary), ad interim, January 11, 1996.\n\nALEXIS M. HERMAN, of Alabama, April 30, 1997; entered upon duties May 9, 1997.\n\nSECRETARY OF HEALTH AND HUMAN SERVICES-DONNA E. SHALALA, of Wisconsin, continued from previous administration.\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-ANDREW M. CUOMO, of New York, January 29, 1997; entered upon\n\nduties January 29, 1997.\n\nSECRETARY OF TRANSPORTATION-RODNEY E. SLATER, of Arkansas, February 6, 1997; entered upon duties February 14, 1997.\nSECRETARY OF ENERGY-FEDERICO F. PEN˜ A, of Texas, March 12, 1997; entered upon duties March 12, 1997. ELIZABETH A.\nMOLER, of Virginia (Deputy Secretary), ad interim, July 1, 1998. WILLIAM B. RICHARDSON, of New Mexico, July 31, 1998; entered upon duties August 18, 1998.\n\nSECRETARY OF EDUCATION-RICHARD W. RILEY, of South Carolina, continued from preceding administration.\nSECRETARY OF VETERANS’ AFFAIRS-JESSE BROWN, of Illinois, continued from preceding administration. HERSHEL W. GOBER,\nof Arkansas (Deputy Secretary), ad interim, July 3, 1997. TOGO D. WEST, JR., of the District of Columbia, April 28, 1998;\nentered upon duties May 5, 1998. HERSHEL W. GOBER, of Arkansas (Deputy Secretary), ad interim, July 10, 2000.", "president": "WILLIAM JEFFERSON CLINTON", "dates": "JANUARY 20, 1997, TO JANUARY 20, 2001", "type": "presidential_administration", "description": "Second Administration of WILLIAM JEFFERSON CLINTON"}
{"body": "PRESIDENT OF THE UNITED STATES-GEORGE WALKER BUSH, of Texas\nVICE PRESIDENT OF THE UNITED STATES-RICHARD B. CHENEY, of Wyoming\nSECRETARY OF STATE-COLIN L. POWELL, of New York, January 20, 2001; entered upon duties January 20, 2001.\nSECRETARY OF THE TREASURY-PAUL H. O’NEILL, of Pennsylvania, January 20, 2001; entered upon duties January 20, 2001.\nKENNETH W. DAM, of Illinois (Deputy Secretary), ad interim, January 1, 2003. JOHN W. SNOW, of Virginia, January 30, 2003;\nentered upon duties February 3, 2003.\n\nSECRETARY OF DEFENSE-DONALD H. RUMSFELD, of Illinois, January 20, 2001; entered upon duties January 20, 2001.\nATTORNEY GENERAL-JOHN D. ASHCROFT, of Missouri, February 1, 2001; entered upon duties February 1, 2001.\nSECRETARY OF THE INTERIOR-GALE A. NORTON, of Colorado, January 30, 2001; entered upon duties January 31, 2001.\nSECRETARY OF AGRICULTURE-ANN M. VENEMAN, of California, January 20, 2001; entered upon duties January 20, 2001.\nSECRETARY OF COMMERCE-DONALD L. EVANS, of Texas, January 20, 2001; entered upon duties January 20, 2001.\nSECRETARY OF LABOR-ELAINE L. CHAO, of Kentucky, January 29, 2001; entered upon duties January 29, 2001.\nSECRETARY OF HEALTH AND HUMAN SERVICES-TOMMY G. THOMPSON, of Wisconsin, January 24, 2001; entered upon duties\n\nFebruary 2, 2001.\n\nSECRETARY OF HOUSING AND URBAN DEVELOPMENT-MELQUIADES R. MARTINEZ, of Florida, January 23, 2001; entered upon\nduties January 23, 2001. ALPHONSO R. JACKSON, of Texas (Deputy Secretary), ad interim, December 9, 2003. ALPHONSO R.\nJACKSON, of Texas, March 31, 2004; entered upon duties March 31, 2004.\n\nSECRETARY OF TRANSPORTATION-NORMAN Y. MINETA, of California, January 24, 2001; entered upon duties January 25, 2001.\nSECRETARY OF ENERGY-SPENCER ABRAHAM, of Michigan, January 20, 2001; entered upon duties January 20, 2001.\nSECRETARY OF EDUCATION-RODERICK R. PAIGE, of Texas, January 20, 2001; entered upon duties January 20, 2001.\nSECRETARY OF VETERANS’ AFFAIRS-ANTHONY J. PRINCIPI, of California, January 23, 2001; entered upon duties January 23,\n\n2001.\nSECRETARY OF HOMELAND SECURITY-THOMAS J. RIDGE, of Pennsylvania, January 22, 2003; entered upon duties January 22,\n\n2003.", "president": "GEORGE WALKER BUSH", "dates": "JANUARY 20, 2001, TO JANUARY 20, 2005", "type": "presidential_administration", "description": "Administration of GEORGE WALKER BUSH"}
